[
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-venues",
        "blogMainTitle": "Wedding Ceremony & Reception",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/5-tips-to-personalize-your-wedding-ceremony",
                "title": "5 Tips to Personalize Your Wedding Ceremony ",
                "richtext": "Though it may be the largest party you’ll ever host, a wedding is inherently intimate. After all, what’s more personal than committing to the person you love? Here’s how to make sure your ceremony reflects your connection: ‍      1. Take a Look at the TraditionsFor some folks, traditions feel meaningful and comforting. For other people, those same traditions can feel stifling. If you belong to the latter group, this is your first opportunity to personalize your wedding ceremony: scrap the traditions!If you’d like to have multiple people walk you down the aisle (or none at all), that’s okay. Don’t want to exchange traditional vows? Write your own! It’s your day, and each decision is up to you. ‍‍‍‍Select a Venue That Holds Special Meaning Is there a particular park, beach, or restaurant you and your partner think of as “yours”? Why not tie the knot there? Of course, it’s okay to simply choose a venue for its beauty, but choosing a place where you first said “I love you,” had an important date, or got engaged can add a deeply personal element to your big day. ‍‍Include Your Pets in the Ceremony If you and your partner have a furry friend who means the world to you, include them in your ceremony for a sweet and personal touch. For example, your pet might accompany you down the aisle, wait for you at the altar, or if they’re especially trustworthy, act as the four-legged ring bearer. ‍Decorate With Symbolic FloralsIf you’re opting for florals to decorate your altar or other elements at your ceremony, choose flowers with special symbolism. For example, you can choose flowers that represent your birth months. Or choose flowers that represent the qualities you love most about your partner. For example, hollyhock represents ambition, and yellow jasmine represents grace. ‍‍Ask a Loved One to Officiate If there’s a dear friend or family member you and your partner cherish, why not ask them to officiate the wedding? Exchanging vows becomes more personal and meaningful when you’re guided through the process by somebody you adore. ‍‍‍Your love story is unique, and your wedding ceremony can be too. Just remember that this is your special day and include the elements that feel perfect for you!‍‍",
                "author": "",
                "date": "December 8, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/10-beautiful-outdoor-venues-in-columbus-ohio",
                "title": "10 Beautiful Outdoor Venues in Columbus, Ohio",
                "richtext": "A lot of people are planning for weddings now that are going to be in the spring, summer or fall of 2022. When people think of Columbus, Ohio an outdoor venue might not be the first thing you think of. But there are actually a lot of beautiful venues here in Columbus that would be perfect for your outdoor wedding. If the weather is a big concern for you, be sure to check out our blog, Rain on Your Wedding Day! Tips and Tricks to Still Own the Day. Those seasons are just around the corner so Devoted is here with 10 outdoor venues perfect for you for your big day here in Columbus, Ohio. The Barn At All OccasionsLocated just north of Central Columbus, The Barn can offer you both an indoor and outdoor wedding experience. The Barn, as explained by the owners, is a venue with a wide open floor plan, 400 person capacity, beautiful lighting and sweeping, high ceiling, air conditioned and heated, optional bridal suites, and outdoor ceremony space. The perfect place for rustic weddings where you can have an outdoor ceremony and indoor reception. ‍‍‍‍‍‍‍‍‍‍‍‍2. The BoatHouse RestaurantWant an outdoor city wedding here in Columbus? The boat has ample entertainment space and a variety of settings, including breezy outdoor patios and an outdoor wedding space for waterfront ceremonies. Some of the features of this venue are the tranquil koi pond, the sparkling waterfall and the fire pits all to be enjoyed while overlooking the Columbus, Ohio cityscape. The outdoor space can host up to 200 guests for a cocktail reception. They also have indoor spaces available if you want to switch it up. The Henry ManorLocated southeast of central Columbus, this premiere wedding and event center is located on 9 beautifully landscaped acres just minutes from downtown Lancaster. The Henry Manor offers a unique experience where you and your wedding party can stay onsite in the Manor which is perfect if you want a stress-free wedding day. They have zero restrictions for outside vendors which is a really nice feature and have a commercial kitchen onsite as well.The Mohicans Tree-house ResortPhoto: https://www.themohicans.net/the-mohicans-wedding-venue/This beautiful venue is one of the largest treehouse resorts in the U.S. sitting on 77 acres just north of Columbus, Ohio with a beautiful landscape overlooking the rolling hills of Ohio's Mohican Valley. They offer a breathtaking wedding venue, 6 lavish cabins and 9 state-of-the-art treehouses in our luxury cabin collection. Guests are encouraged to stay in the treehouses, cabins and country homes during events, perfect if you have a lot of guests traveling for your big day! We are tucked away in the woods and offer a beautiful, uninterrupted connection with nature.The Barn At Sunset ValleyPhoto: https://www.thebarnatsunsetvalley.com/photo-galleryThe Barn at Sunset Valley is an enchanting and affordable central Ohio wedding and event venue located just northeast of Columbus. If you are looking for a beautiful Pinterest-worthy barn perfect for a country wedding surrounded by many lots of areas perfect for outdoor wedding ceremonies. The venue features a beautiful restored barn with so many options for you to personalize your special day. They also include lots of extras in the pricing packages.French Hen FarmPhoto: https://www.frenchhenfarm.com/galleryFrench Hen Farm is a beautiful red barn nestled in the countryside of an 1800’s historic farm on over 100 acres of farmland just northwest of central Columbus, Ohio. You and your guests will be in awe of all of the spacious fields, the unique willow tree, flower gardens and pond. This venue offers indoor and outdoor setting features. They only book one wedding per weekend because they want your special day to be as stress free as possible so be sure to check them out ASAP if interested.The Darby HousePhoto: https://www.darbyhouse.com/galleryLocated on the picturesque Darby Dan Farm just southwest of central Columbus, the historical estate of John W. Galbreath, the Darby House offers its guests a charming, rustic, chic event space perfect for an outdoor wedding. Situated on 1,200 acres of the Big Darby Creek, the venue offers complete privacy and beautiful outdoor and indoor spaces. The Darby House accommodates up to 250 guests with additional capacity for cocktail receptions. Jorgensen Farms Photo: https://www.jorgensen-farms.com/weddings-events/gallerySet between the Columbus suburbs of New Albany and Westerville, Jorgensen Farms offers a beautiful and meaningful location for one-of-a-kind weddings. The refined venue structures, lush gardens, and open fields host uniquely elegant and personal gatherings. A unique feature of this venue is their own farm-fresh produce is central to our culinary and floral offerings you can pick as a part of your wedding package. Here, with a team of dedicated event management professionals at your side, you can orchestrate the place, cuisine, floral design, and program worthy of your celebration.Makoy CenterSpring, Summer, or Fall the option to be married outdoors is available here at Makoy Center in the Ceremony Garden. This beautiful Garden venue is right in downtown Hilliard which is located just west of the city of Columbus, Ohio. With an arbor ready to decorate and simple white chairs, this blank canvas can become a beautiful background for a ceremony and is perfect to add your unique touch to to make your own. It features a Built in trellis, available electricity outlets, provided refreshments and allows for up to 300 guests.The Club at CorazonPhoto: https://clubatcorazon.com/andrea-and-mikeModeling a true Tuscan feel, The Club at Corazon is a wedding venue nothing short of luxury. The Club is a modern waterfront country club located in Dublin, Ohio just north of Columbus. This venue has overlooking views of the Tartan West lakes and features a contemporary design with rustic undertones. This vendor is able to provide all-inclusive service, from event coordination to catering, and is ready to meet all of your wedding needs. It features a lake, on-site vineyard, breathtaking gardens, fountains, waterfalls and more, serving as the perfect backdrop to bring your wedding dreams to reality. Whether you decide you want a rustic, farm feel or a luxury, city wedding venue Columbus has all the outdoor venues you could imagine to satisfy any aesthetic you would want. If you haven't thought about having an outdoor wedding you should definitely look into all the amazing options. A lot of these venues feature indoor portions as well so you don’t have to be outside for the entire wedding. But the outdoors are great for making your special day even more unique and make for great photo ops.",
                "author": "Devoted Columbus",
                "date": "December 10, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/graystone-wine-cellar",
                "title": "Graystone Wine Cellar",
                "richtext": "For the past 30 years, Graystone Wine Cellar has been a full service event venue in Columbus, Ohio, that specializes in intimate gatherings of 20-100 guests. Their ceremony room seats up to 96 people. Graystone also offers a full bar with either dinner service or cocktails and appetizers, which is perfect for any reception! Many engaged couples choose to host their rehearsal dinners at Graystone as well. Graystone’s unique historic venue sets them apart from their competitors, and a simple, straightforward pricing structure makes staying on budget even easier. Graystone Wine Cellar also offers cake cutting and A/V with a screen, projector, wireless microphone, and music system for no extra charge! This historic, Columbus, venue is perfect for any wine loving couple. Meet Brian JohnsonBrian Johnson is the owner of Graystone Wine Cellar, which just celebrated 30 years in business last election day! His favorite part about hosting weddings is that he ‘feels fortunate to play a role in helping newlyweds start their lives together’. Being in this industry allows him to host a variety of events, which leads to him meeting so many interesting people. This is why he loves what he does. Brian’s biggest piece of advice for newlyweds is to set a budget early, and make sure that everyone knows it and sticks to it. It’s very easy to go overboard, so it’s important that the budget is enforced.Outside of hosting events, Brian loves to be outdoors backpacking, camping, and traveling. His goal this year is to hike 10 different National Parks; he’s at 8 so far! His family is very important to him, and he spends as much time with them as possible. For their 30th anniversary, he and his wife went camping, and after that experience she’s still with him. Their relationship has withstood the test of time! The Johnson family wouldn’t be complete without their Retriever/Australian Shepherd mix, Cosmo.Take a Look at These Reviews!“We hosted our rehearsal dinner at Graystone and it was a wonderful event! Brian was a joy to work with throughout the planning process! Many of our guests commented on how fantastic both the food and atmosphere were. We had a number of allergies and dietary restrictions and they were incredibly accommodating. Some of the planning was done long-distance, and Brian was great with all of his communication and had very quick response times!”“HIGHLY RECOMMEND!!!! 100% of our guests absolutely loved the venue and so did we. I feel like every other wedding now is a barn or something similar. The space itself was unique, and required limited décor. And you can do both ceremony and reception there. Parking is easy walking distance and plentiful. It wasn’t too dark and had perfect romantic lighting for it. Plus candles. Nice and cool. You have to see it yourself more than just the photos. I wish I could attach my photos with just the small décor we added that really made it pop from signs at the entrance and small easy centerpieces for table and wall ledges. We did soft blush/champagne gold/ivory/eucalyptus greens and everything an upscale elegant romantic look. The flow of the 3 connecting cellars was actually really easy and beneficial. We had 75 people and it was a perfect size for everything. We did ceremony there and it filled the entire room perfectly, and cocktail/reception following. It was total transparency in the price that depended on guests for food costs only, as the entire 3 cellar facility was free as long as you spent a minimum which we would have done with ~30 people. Brian coordinated everything before which was so easy. They did all the setup and takedown.”ContactPhone: (614) 228-2322Email: graystonecellars@icloud.comWebsite: www.graystonecolumbus.comFacebook: Graystone Wine CellarInstagram: @graystone999Address: 544 S Front St, Columbus, OH 43215",
                "author": "Graystone Wine Cellar",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/questions-to-ask-before-booking-your-wedding-venue",
                "title": "Questions to Ask Before Booking Your Wedding Venue",
                "richtext": "Booking your wedding reception venue and ceremony venue are a crucial part of planning your wedding! After all, your space will be the base of your wedding day. This will be the setting in which you tie the knot with your partner, host your wedding guests, share your first dance, and experience the many joys of hosting a wedding.But, before you book your wedding venue, you will need to be sure that it is truly perfect for your nuptials.We understand just how important it is to book the ideal wedding venue! That’s why, here at Devoted Columbus, as a resource for discovering Columbus, Ohio wedding vendors, we have gathered some questions that you will want to ask before booking your own wedding reception venue. If you would like to discover what these questions are, be sure to continue reading:The Fees. If you and your partner are sticking to a budget, which you most likely are, you need to know how much your venue will truly cost. Ask about all the fees that you will be facing if you book. Also, see what’s included with your fees. Being entirely “in the know” beforehand will ensure that no surprises pop up.Available Dates. Above anything else, you will want to be sure that your venue is available on your chosen wedding date. If not, you will need to make a difficult decision of changing your date or finding a new venue. Before you even venture out to tour venues, check if your date is even available. If it is, go for it! If not, continue your search, as you wouldn’t want to fall in love with a space that isn’t available for you.Catering Options. There are many venues that offer catering options for large events. You should ask your venue if they do as well, and what their culinary options are. This way, you can receive your food at your location, instead of having to outsource it, which certainly will make planning your big day just that much easier.Alcohol Restrictions.Your wedding day is a day to celebrate, and alcohol is likely on your drink list. Be sure to check your venue’s alcohol restrictions before you book. It would be a shame if they didn’t allow the key spirits that you enjoy. Some venues allow you to bring outside alcohol, while others will require that you use their bar services.Not only will these questions help you decide if the venue is right for you, but they will also protect you on your wedding day. After all, you will want to ensure that your big day is planned to perfection!If you are still on the hunt for your own wedding venue in Columbus, Ohio, please get in touch with us here at Devoted Columbus. With years of pairing couples with wonderful Columbus vendors, we would be pleased to do the same for you.",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/how-to-make-your-wedding-ceremony-unique",
                "title": "How to Make Your Wedding Ceremony Unique",
                "richtext": "Are you struggling to find a way to make your wedding ceremony stand out on your big day? Customize and create your ceremony to represent who you are and what you love without feeling pressured to add the old school traditions. Here are some unique ideas you can incorporate into your wedding ceremony that can make your special day feel less traditional and more memorable.Write Your Own VowsThere’s nothing more romantic than sharing with your partner exactly how you feel in front of all your loved ones. Writing your own vows is a great way to make your wedding ceremony stand out by creating a personable atmosphere for your guests. This allows you and your partner to express your love to one another from your own words, written directly from your heart, rather than using the standard vows that are commonly used and written by others. If you are having trouble bringing out the creativity in your thoughts, work with an officiant to help you customize your vows. You can also incorporate a short part of your vows that allows your guests to interact, which brings some uniqueness to your ceremony!Include Your Furry FriendsYour furry friends are family too, so it just makes sense to incorporate them into such a special day. They can be your ring bearers, walk down the aisle with your flower boy or girl, or they can hang around for photo ops! Ask one of your bridesmaids or groomsmen, that your pet knows and trusts, to be the designated pet watcher for the day. This way if they’re being rowdy, someone besides you is on it. Wedding days can also be long, so it may be a good idea to send them home or line up a sitter for after the ceremony is over. They’ll probably be tuckered out too from such a big day that they’ll be ready to go home!Change Up the Processional MusicWalk down the aisle to a song that touches your heart. Choosing a processional song that has a deeper meaning to you and your fiancé is a great way to add unique flair to your wedding ceremony. If you’re not sure which song to pick, some of the more common processional songs include, Somewhere Over the Rainbow (Israel Kamakawiwo’ole), I’m Yours (Jason Mraz), All You Need is Love (The Beatles), Thinking Out Loud (Ed Sheeran), and First Day of My Life (Bright Eyes). You can either choose your processional song with your fiance, or keep it a surprise until they hear it when you walk down the aisle. Keeping it a surprise adds an extra emotional element to your big day, and definitely adds a unique touch!Opt for the NontraditionalIf you and your fiance are looking to break tradition, and want to stray from the traditional wedding rulebook, then choose to change up your wedding walk. Instead of walking down the aisle with a relative, walk down the aisle together. Most people don’t think to do this, and it’s something unique. All families are different, and walking down the aisle with a relative may not be feasible, so walk hand in hand with your soon to be spouse. This is a great way to start your new lives together.Make a Grand ExitThrow out the idea of a traditional rice toss, and choose something more unique and creative. If the ceremony is later at night, exit with sparklers or fireworks! For day weddings, place small bottles of bubbles or noise makers on your guests seats. After the ceremony, your guests can engulf you in bubbles, or send you off with an impromptu jam session. Both of these options require little to no clean up, and they don’t leave you with rice in your hair for the rest of the night!",
                "author": "",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/rain-on-your-wedding-day-tips-and-tricks-to-still-own-the-day",
                "title": "Rain on Your Wedding Day! Tips and Tricks to Still Own the Day",
                "richtext": "Spring is here and with it the chance of unpredictable weather, especially rain.  Many couples are also choosing to host outdoor themed weddings due to the recent onslaught of COVID-19.  If you are worried about the possibility of rain on your wedding day, here are some tips and tricks to still own the day and make amazing memories.Plan AheadWork with your wedding planner and vendors ahead of time.  Get to know their protocols in case of a rainy wedding day. Rent a TentRenting a tent will assure your wedding guests have a place to go and stay dry.  Clear wedding tents are a great option to still take in the landscape and make for beautiful rainy-day photographs.Pass Out UmbrellasUmbrellas that match your wedding colors will not only be useful on a rainy wedding day but will also make fantastic wedding favors for guests to take home.Keep Dry Towels HandyMake sure you have these so your guests and wedding party can dry off quickly and easily.  It may also help to have a hair dryer handy as well.Protect Your DressIf you are worried about your wedding dress getting muddy you could spray the bottom with Scotch Guard to help protect it for those amazing photographs you will want to take in the rain.  If you are not comfortable doing it, many dry-cleaning services can do it for you.Take Epic PhotosRemember that rain makes rainbows!  There are so many creative photographs that can be taken on a rainy wedding day.  Decorative or clear umbrellas make fun couple photographs or you could wear your favorite rain boots with your wedding dress.  Whatever direction you decide to take rain makes for some stunning photographs.Make MemoriesThere is nothing more memorable to your guests than when the cute flower girls and ring bearer were dancing in the rain.  It may not be ideal but embrace it and make some incredible memories with your loved ones.",
                "author": "",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/hofbrauhaus",
                "title": "Hofbrauhaus",
                "richtext": "Hofbrauhaus is a German Bier Hall and Brewery that has been in business for six years. They offer a menu of German and American dishes to please a variety of tastes. Hofbrauhaus also brews their own biers on-site and offers a full bar of cocktails, liquors, and wines available for your rehearsal dinner! They don’t stop with amazing food and beverages, they also offer live entertainment options, private keg tappings, brewery tours, audio/video capabilities, and gift shop merchandise perfect for event favors. Hofbrauhaus specializes in large group gatherings where guests can visit with each other while enjoying delicious food, freshly brewed bier, and live entertainment. They have a large space that can accommodate a larger group of people than most restaurants, which is perfect for rehearsal dinners! Their spaces are beautifully decorated and modeled after the original Hofbrauhaus in Munich, Germany, the ambiance sparks conversation and brings people together.Meet Susan Von BargenSusan is the Events Manager at Hofbrauhaus Columbus. She has been married 21 years and her one piece of advice is to plan the wedding and associated events that YOU envision. Don’t let others opinions sway you from your vision. This is your day and it should be everything you want it to be! Other than organizing wedding receptions, rehearsal dinners, parties, and other amazing events, Susan has three kids that are very involved in sports, she loves being at the ball fields. She loves everything pumpkin and can’t wait to decorate for Halloween! When she got married she put the ring on the wrong finger of her soon to be husband!Check out these reviews!“Susan, Everything was incredible and your entire team was excellent! Extra special thanks to your head chef, Josh, and your lead server, Billy, who ensured everything went as planned and all of our guests had a great time. We have received many compliments that it was one of the best weddings our guests have ever been to and we are happy to report everyone is home safe and healthy! We will definitely be writing up some great feedback for guys on Facebook and Google and will share some pictures with you to use for your website / branding. Thanks again for all of your help on making it happen!” -Ryan and Crystal“Susan, Of course Justin and his team knocked it out of the park again. Best group of servers I have experienced in our 4 or 5 trips – which is a compliment.” -TMContact:Phone: (614) 294-2437Email: events@hofbrauhauscolumbus.comWebsite: www.hofbrauhauscolumbus.comAddress: 800 Goodale Blvd, Columbus, OH 43212Facebook: https://www.facebook.com/hbhcolumbusInstagram: https://instagram.com/hofbrauhaus_columbus",
                "author": "Hofbrauhaus",
                "date": "November 26, 2021"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-trends",
        "blogMainTitle": "Wedding Trends",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/6-ways-to-immerse-lgbtq-pride-into-your-wedding",
                "title": "6 Ways to Immerse LGBTQ+ Pride Into Your Wedding",
                "richtext": "There are many wedding inspiration posts that are made of cookie-cutter ideas, but there aren’t many that are very inclusive of the LGBTQ+ community and of all relationships. The demand for diverse and inclusive weddings has continued to grow. Which is why we have gathered six fun different LGBTQ+ wedding inspiration ideas that you can incorporate into your wedding to show your pride! Love is love and we are here to support you and your wedding!1. Wear Purple SneakersThe rainbow is specifically associated with the LGBTQ+ community, but let’s not forget about the color purple which is a classic symbol of pride and solidarity. Showing off your pride by wearing purple sneakers definitely makes a statement and will be loved by your guests at your wedding. You can also opt to incorporate different shades of purple throughout your wedding.2. Slice Into a Rainbow CakeThe rainbow flag is one of the most popular ways to show support for the LGBTQ+ community, with six colors (red, orange, yellow, blue, green, and purple).  If you are planning on having a textured buttercream or traditional fondant cake at your wedding, use each layer to display a different color of the flag. Incorporating these colors into your cake will definitely add a prideful twist to your wedding cake!3. Send Guests Home With Rainbow FavorsThe goal is to leave your guests with something fun and memorable, which is why rainbow favors are perfect! Creating rainbow candy favors are great and will be loved by those with a sweet tooth all while showing your support for the LGBTQ+ community. You can also leave your guests with rainbow shot glasses that have been personalized with you and your partners names to remember your wedding by.4. A Colorful Bouquet or BoutonniereMost wedding bouquets already consist of an array of beautiful florals in different shades, but if you’re looking to show off your pride then opt for florals that are shades of red, yellow, blue, green, orange, or purple to represent the LGBTQ rainbow flag. Don’t feel forced to use every color, you can choose three colors that match well with your wedding theme. Since boutonnieres are smaller than bouquets, you may want to narrow it down to two shades of the rainbow.5. Include Pronoun Pins for Your Guests to WearIncluding pronoun pins at your wedding is a great way to involve your guests and allow them to show off their pride and support for you, your partner, and the LGBTQ+ community! These pins can be passed out as people are entering the ceremony or make for the perfect wedding favors.6. Show Off a Pride Flag in Your Wedding PhotosIncorporating a rainbow flag will make a bold statement and show off your pride. A rainbow flag can also add a pop of color into your wedding photos. If you’re looking to be bold and proud at your wedding be sure to have a rainbow flag on hand to incorporate into photos.",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/wedding-traditions-from-all-over-the-world",
                "title": "Wedding Traditions From All Over The World",
                "richtext": "Here’s a list of some of our favourite wedding traditions from across the globe (thanks to easywedding) – and even if you’re not of a certain religion or ethnicity, there’s no reason why you can’t incorporate them into your big day!The Money Dance (Poland)The Money Dance or Dollar Dance first came to prominence in the early 20th Century, and is believed to have evolved from a folk dance performed by couples married during Europe’s harvest season. Traditionally, the bride wears a purpose-made apron over her wedding dress, and guests must then pin money to her in exchange for a dance. Like most traditions, there is an order of etiquette that should be observed; the groom being first, followed by the father of the bride, relatives then close friends. The Money Dance is found in many cultures and, though traditionally it involves male guests paying to dance with the bride, these days many female guests will do the same for a dance with the groom.Polterabend (Germany)Plate-throwing is a custom synonymous with lively Greek wedding receptions, but they aren’t the only ones who know how to have a good time smashing plates. In fact, the German tradition of Polterabend is alleged to be older, originating in a time when it was customary to smash a clay altar immediately following a sacrifice to the Germanic gods. Traditionally, Polterabend takes place on the evening before the actual wedding, and guests are expected to bring small gifts, as well as the obligatory plate or flowerpot for throwing. The action of smashing either is thought to bring luck to the couple and while the pre-wedding party is still popular in some parts of Germany and the US, however many modern brides now incorporate the tradition into the wedding reception instead.Varmala (India)Indian weddings are full of inspiring traditions and rites, many of which have specific meanings. Perhaps the best known is the Mehndi ceremony where the bride-to-be’s hands and feet are painted with intricate henna tattoos. Another lovely custom is that of Var Mala, which refers to the gifting of floral garlands between husband and wife after the initial vows have been exchanged. This is one of the most important rites in the entire wedding ceremony, representing the bride’s acceptance of the groom as her husband for life!Planting a tree for the bride (from the former Czechoslovakia)Need another excuse for a night with the girls before you get married? In Czechoslovakia, preparations for the bride start early and continue right up until the eve of her wedding. A small, celebratory party is held by close female friends and family, during which a tree is planted in the bride’s garden, then decorated with coloured ribbons and eggshells. Legend dictates that the bride will live for as long as the tree flourishes. Modern interpretations relate this to the life of the marriage, rather than that of the bride. Another lovely tradition is placing an infant in the bridal bed before the marriage to ensure fertility.Marrying on the half-hour (China)From the land of Fung Shui comes the tradition of couples marrying on the half-hour rather than on the hour as it is said to bring luck to their marriage because they are marrying on an ‘upswing’ since the hands of the clock are moving upwards rather than downwards.Blackening (Scotland)You need to have a sense of humour to partake in the Scottish pre-wedding tradition of the Blackening which involves being covered in mud, muck and/or soot the day before your wedding. The tradition is thought to have originated in Scotland’s Orkney Islands, and involves both the bride and groom being smothered in a mixture of tar and feathers (but it could also be flour, eggs or curdled milk), then either tied to a tree or paraded through the town’s streets in humiliation. This rather messy tradition is meant to give the bride or groom a ‘taster’ of the humiliation that married life may bring.The Lasso (Mexico)Mexico’s rich heritage and ancient culture means that many of its most important ceremonies, such as weddings and funerals, are steeped in tradition and ornate ceremony. One such tradition fast gaining popularity in the West is the “lasso” – a white cord or ribbon, but usually an ornately decorated rosary, that is large enough to place around the shoulders of the bride and groom simultaneously. It symbolises the binding love and commitment between them. Customarily, the bride and groom each choose a ‘padrino’ (sponsor) to present the lasso at the start of the service. Once the service is over, the groom removes the ribbon and presents it to his new wife as a token of his newly confirmed love for her.The gift of 13 coins (Spain)Whether pinned to an apron or sealed in a bag, there’s no mistaking the importance of monetary wedding offerings to various cultures. In Spain, it’s customary for the groom to present his bride with a bag containing thirteen gold coins on the eve of their wedding. The 13 coins represent Christ and his 12 Apostles. The bride must then carry her bag of gold coins during the ceremony. Some couples follow the older Roman custom of presenting one another with coins during the wedding ceremony; the bride a bag of silver, and the groom a bag of gold as a pledge of commitment and support to his bride.Throwing a wine glass (Italy)Italian weddings tend to be lavish affairs guided by religious customs and rites and several of these traditions are seeping into non Italian weddings, including the traditional coffee-laden wedding cake. Though the throwing or stomping on of glasses is generally associated with Jewish and Greek cultures, many Italian grooms uphold their tradition of throwing a wine glass at the wedding reception. The number of shattered glass shards is said to foretell the number of years the couple will remain happily wed and prosperous.The wedding cake pull (Peru)All the single ladies at a Peruvian wedding get to do something that’s far more fun than a bouquet toss, they get to perform the wedding cake pull! This involves charms being attached to ribbons that are placed in between the layers of the wedding cake. Before the cake is cut by the bride and groom, each single female guest must pull one ribbon. One of the ribbons is attached to a fake wedding ring and, it is said, that the single lady who pulls that ribbon will be the next to marry. It beats the jostle of the old bouquet toss hands down!",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/send-off-ideas-for-your-wedding",
                "title": "Send-Off Ideas For Your Wedding",
                "richtext": "Imagine, you married the man of your dreams, the reception is where you always wanted it to be , the first dance was a dream, now it’s time for you to live happily ever after. How are you going to make your send off end your wedding day so it’s even more unforgettable?Listed below are some fun and exciting send off ideas to use at your Wedding!Walkway of CandlesThis will definitely create an ambiance like you're being sent off from your wedding and walking into your next chapter in life. The lighting will even be perfect for your photographer to capture the moment. You can make this even more special by having flower petals surrounding your walkway and candles. This is an artsy and cute way to create a glowing aisle as the couple enters the next chapter of their lives!Release BalloonsThis is such an uplifting moment , especially for a daytime wedding. Don’t forget about the environment, you can purchase biodegradable balloons online to make it environmentally friendly . All the guests can also attach their hopes and wishes for the couple and at the end of the reception everyone can go outside and release the notes and balloons as the couple is being sent off!Release Sky LanternsAre those stars in the sky? No, they’re Sky Lanterns! This is a particularly good idea if you are planning on having an outdoor or evening reception.You can have your guest involved by giving them each a lantern to launch themselves. Light up the night sky with gorgeous lanterns and make a fantastic send-off that you and your guests will never forget! This will be another amazing photography moment for your photographer at your wedding to capture. FireworksNow here is something that will definitely go off with a bang, literally. Nothing says celebrate like a good fireworks show. All of your guests can gather outside for a fabulous show of fireworks before you leave. It's also a great option for evening weddings. It will be a great conclusion to a wonderful wedding and a great start to a new journey perfect for your photographer to capture this huge, cinematic, romantic moment between the new couple!BubblesWant to leave your wedding without worrying about unnecessary cleanup? Then bubbles are the perfect match for you. You can bubble your way to your happily ever after at dusk or at night with glow-in the dark bubbles.Each guest can be granted a bottle of bubbles when they arrive at the reception or ceremony. Then as the couple departs the air can be filled with hundreds of tiny little bubbles!Confetti PoppersThis is a cute and celebratory way to send off the happy couple! The guest can pop the mini confetti cannons and the couple can be sent off in a sea of rainbow specks and sounds of excitement! Just make sure if your venue requires you to pick up any send-off items. You don’t want your guest cleaning up after the end of the night!SparklersSome venues are not open to anything involving flames , but you still want your send-off to have stunning visuals? Sparkles are a classic and beautiful way to send the merry couple onto the next adventure!  All the guests will enjoy spelling words and making shapes with the beautiful sparks!",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/dublin-bridal",
                "title": "Dublin Bridal",
                "richtext": "Dublin Bridal has everything you need when it comes to finding your perfect wedding dress. They have been in business since 2018 and are truly passionate about working with every bride and groom! Their company began as an alteration boutique providing services in all the final touches of each bride and groom’s special day, including their bridal parties. As they grew, they started introducing more regarding custom suiting and tuxedo rentals, bridesmaids collections and eventually opening our bridal boutique and partnering with the most stunning bridal designers in the world today! They began as a local business providing a service to our clientele with esteemed attention to detail every step of the way, that approach still rings true today! They specialize in wedding dresses but also offer tuxedo/suit sales and rental along with custom tailored tuxedos/suits. It is important to their team that they offer an extraordinary experience to every client. They love to celebrate with their clientele and their loved ones. Their boutique includes private fitting rooms, one on one appointments with amazing stylists, as well as a carefully curated collection of the most fashion forward wedding gowns from top designers! Meet Elizabeth Van DuinElizabeth is the store manager at Dublin Bridal, in Dublin Ohio. She loves to knit, crochet and sew which led her to study fashion design where she had the opportunity to spend time abroad in both Florence and Amsterdam. She first entered the bridal industry as a seamstress and eventually worked as a stylist until her most recent position at Dublin Bridal! She has always loved working with people and providing service, nothing brings her more joy! Her one piece of advice to engaged couples is to simply follow your hearts on all the choices during the planning process. The amazing part of planning a wedding is that you can really curate your event to best suit you as a couple and celebrate your love with your closest friends and family. Believe in yourself when making decisions together, partnering with esteemed vendors that you feel that positive connection with and enjoy the journey together!Still not sure Dublin Bridal is the right fit? Check out these reviews!Was the first place I went thinking I’d just get an idea of what I wanted in The Dress. Elizabeth was so sweet & so knowledgeable. My mom and I decided as soon as we left our first appointment that we wouldn’t be going anywhere else. Every dress I tried on was beautiful, but I was drawn to one the first visit. I decided to think on it & bring a bridesmaid with me for a second visit. We tried 6 or so new dresses on—again, all beautiful—but when I put my original choice on again, I knew it was The Dress. I stayed within my ideal budget for my dress and veil. The layaway option is also super helpful. This is a wonderful shop that I would highly recommend to any and everyone. -Samantha BarhorstI went to 4 different bridal shops/boutiques around Columbus the past two months in search for a gown. In total, I tried on about 20 different dresses. While I didn’t end up selecting one of the dresses at Dublin Bridal, I loved most my experience here. The prices are great. The service is not pushy what-so-ever, and the vibe there is calm and collected. Elizabeth helped me into gowns and was very attentive, extremely patient and exceptional to work with. -Abigail LucasContact:Phone: (614) 553-7146Email: info@dublinbridal.comWebsite: www.dublinbridal.comAddress: 313 W Bridge StFacebook: www.facebook.com/dublinbridalInstagram: www.instagram.com/dublinbridal",
                "author": "Dublin Bridal",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/picking-out-your-wedding-dress",
                "title": "Picking Out Your Wedding Dress",
                "richtext": "Deciding what you’re going to wear on your wedding day is arguably one of the biggest decisions you will make in regards to your big day! While it can be stressful trying to just pick one dress, it’s also so much fun to try on dresses to find what you love! We put together a step-by-step guide to how to pick out your wedding dress with as much ease as possible.Before BuyingThere are some things to think about before you actually go to buy your dress- Here are our guidelines for this!Get Some Inspiration!If you haven’t had your wedding planned since you were 15 on Pinterest… You can start now! Shopping for a dress will be way easier if you already have in mind dress styles that you like! Take to Pinterest, Instagram, TikTok, or bridal magazines to figure out what style wedding dress you like! Once you’ve gathered your inspiration, figure out what is consistent among all of the dresses you liked. Do they have long sleeves? High neckline? Ball gown style? Thanks to technology, your algorithm on these sites will probably start putting dresses in similar styles to ones you like on your explore pages. Once you find the common thread, you have your foundation ready to search for your dream wedding dress!Figure Out What Style Dress You LikeHere are some different styles of dresses to give you some ideas!Set a BudgetBefore you start thinking about shopping for your dress, you should probably set a budget for how much you want to spend. If someone is helping you pay for your wedding, it’d be a good idea to talk to them and decide on a budget. This will be helpful when you’re shopping, because you’ll know not to even bother trying on dresses that are out of your price range. Make sure to consider shoes, a veil, and jewelry when setting this budget.Explore Different Buying OptionsThere are so many options when it comes to finding a place to shop for your wedding dress! Here are some recommendations based on what kind of dress your looking for:Chain Store (David’s Bridal, Wendy’s Bridal) – These stores will have a wide range of sizes, styles, and prices. While they may not be the most unique dresses, you’ll definitely be able to find something at these stores!Local Boutiques (Dublin Bridal, La Jeune Mariee Bridal Collection, if in Columbus) – Local boutiques will often have designer dresses if your price range is a little higher.Online Stores (BHLDN, Truvelle) – If you’re looking for an extreme dopamine release, buy your dress online!Thrift Shop (Goodwill, Bridal Consignment Shops) – Looking for a real bargain? Look up local bridal consignment shops and thrift shops and try your luck there.Online Resale Shops (Poshmark, StillWhite) – This is also a great way to save some money! You may have to do more searching, but you definitely will be able to find something on one of these sites!Buying Your DressNow that you’re ready to buy your wedding dress here are some tips:Bring BackupWhen you decide to go shopping, make it easier on yourself by bringing a small group of people. Think about 2-3 people whose opinions you really value to bring with you, maybe your mother, your future mother-in-law, and your maid of honor. You’ll want people there who will hype you up and help you find your dream dress- there’s nothing worse than bringing someone who hates every dress you try on!Dress Up a LittleA friend who's been married told me that when you go to try on your wedding dress, you should do your hair a little and put some makeup on, to give you a better idea of what you would look like in the dress on your wedding day! Bring a pair of heels with you as well, if you’re planning on wearing heels on your wedding day. Also- wear plain undergarments!Don’t Rush Your DecisionsDon’t feel like you have to pick a dress the first time you go shopping! After all, this is your dress! You may find something you absolutely love if you give some time between bridal appointments. This is a super important decision to make, don’t let others rush you into making a choice you’re not 100% about!Have Fun with it!Picking out your wedding dress can be stressful, but it’s also so exciting! When you think about your wedding day, what you’re wearing is probably the thing your mind goes to first, aside from your groom. Finding your dress should be a really fun experience! We hope that our tips are helpful to you and we wish you the best of luck!",
                "author": "",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/rehearsal-dinner-theme-inspiration",
                "title": "Rehearsal Dinner Theme Inspiration",
                "richtext": "It is the day before the Big Day!  You have done all the planning and organizing and now it is time to celebrate with your family and close friends that have stood beside you through the whole process.  When it comes to the rehearsal dinner there are no rules.  You can make it as formal or as relaxed as you would like.  Here is a list of some fun and unique rehearsal dinner themes to kick off the celebration of your wedding day!Backyard Barbecue ThemeFire up the grill and have fun serving up some of your favorite meats and vegetables.  You can go with traditional burgers and hot dogs or something gourmet like grilled shrimp and asparagus.  The possibilities are endless.  You can choose to host at a barbecue restaurant or in someone’s backyard.  Backyard games like corn hole or croquet will add to the fun and relaxation!  Your guests are sure to have a great time.Bowling ThemeWas you and your fiancé’s first date at a bowling alley?  Then this will be the perfect theme for you.  You can serve pizza and beer or go to a restaurant after the game.  Bowling is a great way to bond with your family and friends and celebrate all your hard work.  Go casual and get some great photos in your bride and groom bowling shoes.Movie ThemeYou can make a movie themed rehearsal dinner personal by screening you and your fiancé’s favorite movie.  Set up a projector screen outside or inside and serve up popcorn and your favorite movie theater candy.  You can even set up a fun movie themed photo booth for your guests to enjoy.  At the end you can showcase the story of how you fell in love on the big movie screen!Casino ThemeInvite your guests to your favorite casino or host it yourself with casino games like roulette and poker tables.  Get customized decks of cards to add to the excitement.  Give out prizes and have fun!Wine or Distillery TastingIf you enjoy something more formal Columbus offers some fantastic wineries that will serve your favorite wine for you and your guests.  Enjoy cheese and charcuterie boards or an elegant dinner.  If wine is not your thing then maybe hosting the celebration at your favorite local distillery.  The light and romantic atmosphere will be a perfect way to begin your wedding celebrations.Brunch ThemeGet the mimosas ready!  If you have your wedding rehearsal earlier in the day you can consider a brunch theme.  Serve some of your favorite breakfast cuisine and enjoy.  Another advantage of a brunch theme is there is more time to mingle with family and friends and you get more rest the night before the wedding.Rehearsal dinners are your chance to get creative.  They can be as formal or informal as you would like.  Make it personal to you and your fiancé.  Celebrate where you had your first date or at your favorite sports pub.  Whatever you decide it will be sure to be a memorable experience for you, your family, and close friends.",
                "author": "",
                "date": "November 26, 2021"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-planning",
        "blogMainTitle": "Wedding Planning",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/why-you-should-have-a-wedding-plan-b",
                "title": "Why You Should Have A Wedding Plan B ",
                "richtext": "Here are three reasons why you need a Plan B for your wedding.‍The Best Laid Plans...‍As much as we may be list-makers and planners, we can’t control everything. All it takes is for Mother Nature to take a wrong turn at the ocean and, suddenly, they are calling for heavy rain on what was supposed to be your bright and sunny wedding day. ‍Prevent your wedding from getting derailed by weather by having a plan B in place so you can easily change course if needed!‍‍The Guest List Matters ‍Your guests are a big part of your wedding day and their comfort matters! If Aunt Mimi just got over the flu or cousin Jerry is in a wheelchair, a wet and muddy setting just won’t do. These considerations are just as important as what type of appetizer you choose. Trust us, nothing brings a wedding to a screeching halt quite like a sick, soggy aunt!‍You also don’t want a crowd full of dripping, uncomfortable guests glaring at you while you trudge down a muddy aisle. Something tells us that probably isn’t how you envisioned your big day.‍It Can Be As Easy as 1-2-3‍Many venues have contingency plans available — all you have to do is ask what they typically do in case of inclement weather. Many have tents, extra heaters, portable fans and air conditioners, and all kinds of ways to battle the forces of nature. ‍There are also lots of simple things you can do yourself to combat the weather. Grab some cost-friendly umbrellas that can be used rain or shine. Expecting a little more of a winter wonderland? Gloves and scarves can come in very handy and make great wedding favors. ‍Also, ask your wedding planner! They’re no stranger to contingency plans and will have plenty of ideas that won’t break your budget. If you haven’t hired a wedding planner, consider how much they’ll help if things go awry! Unpredictable weather is just the type of thing that makes having someone in your corner worth all the bang for your buck. ‍Need help coming up with your own wedding’s Plan B? We’ve got your back! Take the next step in planning your dream wedding (rain or shine) and book a consultation call with us today! ‍",
                "author": "",
                "date": "March 8, 2023"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/how-to-deal-with-stress-around-your-wedding",
                "title": "How to Deal With Stress Around Your Wedding",
                "richtext": "There’s no denying it – planning a wedding can be incredibly stressful! From managing your guests to working with different vendors, checking off every box of your to-do list can seem impossible.But before you let burnout take over, know there are a handful of things you can do to stay sane and enjoy this time. Here are seven ways to deal with stress around your wedding.‍‍Pencil in time for yourselfYou might be tired of people telling you to schedule in some self-care, which is why we recommend taking this one step further! Pencil in time on your calendar (Google, Microsoft, wherever most people get ahold of your schedule) and treat it like any other type of meeting. Know that if you miss it, your stress levels will only rise! ‍‍‍Plan one month aheadTo secretly stay ahead of your wedding-related tasks, pretend you’re getting married one month earlier than you actually are. This way, you’ll be weeks ahead of schedule! Giving yourself a buffer will ensure stress doesn’t fully take over and you have time to prioritize the important things. ‍‍Avoid comparisonYes, Pinterest and Instagram are great places to gather wedding inspiration, but if you continuously scroll and compare yourself to others, remember this: Comparison is the thief of joy. Stress will consume you if you compare each aspect of your wedding to someone else. Know that your day will be incredible because it’s the start of your marriage, and what another couple’s wedding looked like doesn’t matter. ‍‍Give yourself graceEven the most laid-back couples experience stress around their wedding. So be sure to give yourself grace! Know that what you’re feeling is both valid and normal. Acceptance can go a long way when it comes to wedding planning stress.‍‍ Talk to someoneIf you and your partner keep spinning your wheels, it may help to talk to someone more removed from the situation. Whether a cousin or a co-worker, sometimes an outside perspective is exactly what we need to see things clearly. Talk to someone about your stress and know it’s perfectly okay to schedule an appointment with a therapist as well!‍‍ Put your relationship firstAt the end of the day, your wedding should be about one thing: you and your partner starting your lives as a married couple. It’s all about love! So remember that the food and décor will only get you so far. Take time for yourselves as fiancés, and know it’ll all be over before you know it.‍‍Wedding planning is often associated with stress, but you’re sure to reduce the heavy weight on your shoulders if you follow these tips!‍",
                "author": "",
                "date": "December 15, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/how-to-plan-an-elegant-eco-friendly-wedding",
                "title": "How to Plan an Elegant Eco-Friendly Wedding",
                "richtext": "Love mother earth as much as you love your partner? We have a few tips for hosting the sustainable wedding of your dreams. Let’s dive in! ‍1. Plan your wedding around local, sustainable events. If there’s already an earth-friendly event happening near your venue, consider hosting your wedding around the same time. Many vendors will be happy to stick around an extra day or two for your wedding. As a bonus, your guests may enjoy attending the event in the days leading up to your ceremony! ‍‍2. Serve locally grown food. Buying local and sustainable food is a great way to help the environment. Not only will you be supporting your local economy, but you’ll also be taking steps to reduce your carbon footprint. Forgo the exotic and expensive foods in favor of healthy dishes from local farmers.If you’re having a smaller, more casual wedding, you may even consider asking local friends to contribute produce from their gardens. It’s an excellent way to get more people you love involved in your special day. ‍‍‍‍3. Consider using eco-friendly decorations and favors. With the popularity of Pinterest and other DIY resources, more couples are finding ways to make their weddings unique while being mindful of their environmental impact. There are many options for decorating with recycled or natural materials that will save you money as well. We love the rustic look of a recycled paper wedding favor or upcycled glass jars stamped with the soonlyweds’ initials. ‍‍‍4. Inspire your guests to go green. Though you shouldn’t pressure your guests to make any decisions, it’s appropriate to add a note on your wedding website informing them that your wedding will be eco-friendly. Include a list of ways they can contribute to your sustainable theme, like carpooling to the venue or donating to an environmental non-profit instead of a wedding gift.‍‍5. Opt for locally-grown flowers. There’s something really special about decorating with flowers grown near your venue. Not only will these blooms be fresher and more beautiful, but they’re better for the earth. They’re also a healthier option, as they’re likely to be treated with fewer chemicals. ‍6. Think minimally. At the end of the day, the most sustainable wedding will be the one that uses the fewest resources and materials. So if you’d like, opt for a minimalist wedding with simple décor, low lighting, and a reasonable amount of food. The less you waste, the better!‍‍7. Every little bit matters, so try not to stress. Most importantly, remember that hosting an eco-friendly wedding is a big challenge , so you should be proud of any earth-friendly decisions you make. ‍‍It may not be possible for every single aspect of your big day to be eco-friendly, so focus on the areas important to you and let the rest go. You’re doing your best. As long as you’re doing what you can to love the earth, we promise that the earth will love you back!‍",
                "author": "",
                "date": "December 1, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/8-clever-ways-to-keep-children-entertained-in-your-wedding",
                "title": "8 Clever Ways to Keep Children Entertained in Your Wedding",
                "richtext": "When you start planning to say ‘I do,’ there is so much to think about. Little people are an important part of any special day. Whether they’re your own children, part of your wedding party, or simply part of the guest list, children and weddings will almost always go hand in hand. This can, of course, become a point of stress for many brides. You want the cute factor without the stress factor.‍Here are a few ways to keep the younger ones busy enough so that everyone can have a good time and you can enjoy your wedding as much as your guests. No doubt you’ll have the adults joining in on the fun too!‍1. Ask Them To Help Capture Memories On PaperHave some crayons or felt tip pens and paper handy on the kid's table or where they’re seated, and tell them they have the super important job of drawing a picture to help the bride and groom remember their special day.You’ll be amazed at what children come up with, and you might even end up wanting to hang one of the pieces in your home. You could even turn some of the creations into thank-you stationery or gifts to send out after your wedding.‍‍2. Let The Children Play DJChildren love music, and their animated dance moves make for some great photo moments and memories. Let the children at your wedding know they can take over the playlist and be DJ for 10 minutes at your chosen point in the day. They will love having the chance to choose a song or two to dance to, and there will undoubtedly be some moments to remember.You could encourage the children to choreograph a dance together, and they can then perform it for everyone. That’s sure to keep them busy for a while. If you’re not keen to give up your music selection entirely, ask the DJ in advance to prep a few kid-friendly options they could choose from.If you want to brush up on your own dance moves before the big day, we’ve got some great vendor recommendations for dance lessons.‍‍‍3. Let Their Imagination Run Wild At The Photo BoothWho doesn’t love a photo booth, regardless of the occasion? Enjoy posing with props and taking silly photos with the kids at your wedding.Throw in a few extra props that might appeal to the younger generations, and you’re sure to have lots of laughs. This is also the ideal way for guests to remember the special occasion and for you to have extra snaps for your wedding album.‍‍‍‍4. Give The Children A Job To Do (and a Special Hat Or Badge)The trick here is to help the children at the wedding feel important (as well as the job you give them), and watch them turn it into a game. It can be anything from carrying your shoes while you have photos taken, calling family for photos, or guessing who will catch the bride’s bouquet.Whatever job you task them with, have a badge they can wear or something that indicates they have been tasked with this very important duty.‍‍‍‍5. Bring In The Professionals To Facilitate Fun And ActivitiesBring in some extra hands to help keep the children happy. There are great options for vendors who will provide expert care at your wedding event. Half the challenge of ensuring the children are entertained is having enough people to watch them and facilitate the activities.We have great local vendors who can take care of all the details for you. This frees up the adults to relax and enjoy themselves, knowing the kids are looked after. Cheers to that!‍‍6. Have A Spare Phone Or Camera Available And Ask The Children To Take Selfies With GuestsAside from the professional photos from your wedding day, it can be just as fun going through the moments other people have captured. Children have a knbaack for bringing out the fun in every situation. Even if your professional photographer can’t get a smile out of that grumpy uncle, perhaps the kids can with a silly selfie.So much detail goes into a wedding, and you want to remember and soak it all up. Having extra little photographers running around capturing what they see will probably be surprising and delightful at the same time.‍‍‍‍7. Have A Candy Bar As Your Dessert TableNeed we say more? Who doesn’t love an amazing display of different chocolates and candies to choose from? You could even have an ice cream truck offering decadent and cold sweet treats that will please every age guest at the wedding. Other sweet table ideas include a donut station, build-your-own s’mores, and a cake bar.Depending on how you’ve worked out your wedding budget, you can go as simple or elaborate as you like. The options are endless. Whatever you choose, the children will love that they can dish up their own sweets, and you’re not limited to a specific dessert time. That means more time for dancing.‍‍‍8. Have Some Lawn Games Or An Interactive DisplayWhile having your photos taken and your guests mingle, why not have some lawn games or another interactive feature that creates conversation and connection? Depending on your venue and the space available, choose something that you love. If there’s time, you might even want to create the display or interactive games yourself.Games make for a great conversation starter and are also an ideal ice-breaker if you have several guests who don’t know one another. Something like a magician is also a crowd-pleaser for guests of all ages.‍‍‍‍A Kid-Friendly Wedding Is More Fun For EveryoneYour wedding day is one you’ll always remember (and we want it to be for the right reasons). So much love and planning go into your special day, and knowing the children are entertained for the event will be a huge point to tick off your to-do list. Here’s to your big day being one full of smiles and without any tantrums. Happy planning.‍Written for Devoted Columbus by Katie Colon",
                "author": "",
                "date": "November 22, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/a-guide-on-how-to-book-the-best-wedding-venue-for-you",
                "title": "A Guide on How to Book the Best Wedding Venue for You",
                "richtext": "‍When planning their wedding, many couples face the age-old challenge of selecting the perfect venue. Do you go with the traditional church setting or branch out to more creative places, like a museum or a warehouse? ‍Well, it depends on what you and your partner want! Selecting the right place will take some forethought and planning ahead of time. This process can be stressful and frustrating if you don’t know where to start, and no one should be stressed out while planning their dream day. ‍So how do you select the wedding venue that’s right for you? Here’s a helpful guide that will take you from wedding venue novice to venue grandmaster. Let’s dive in! ‍Before you start scouring the internet for a venue, take some time to think about all the things you want and need in a venue. Knowing these key elements will make the process easier. These are the most important things to consider: ‍Determine how far it is from friends and family.If you plan on having a large wedding, it’s a good idea to pick a venue that is centrally located for most, if not all, of your guests. If a destination wedding is what you’re after, keep in mind that some of your invited guests will not be able to make it. ‍‍Make sure it’s within your budget.It may be tempting to opt for a grand space outside of your budget, but keep in mind all the other things you need to pay for to bring your dream wedding to life. There’s no point in having an extravagant venue but not enough funds to cover flowers, decorations, quality catering, and other essentials!‍Ensure it will be available on your wedding date.Start the wedding venue shopping process early to secure your spot for popular venue sites, especially if you’re getting married during wedding season. Many venues book up fast, so before you get your heart set on one, make sure you can reserve a time that aligns with your ideal wedding date.‍Does it fit your theme? You wouldn’t want to get married at a Victorian-era chapel if you’re going for a rustic, country theme. Likewise, a minimalist art gallery won’t fit into your kitschy vintage design! Pick a venue that matches your theme and aligns close to your vision. ‍Determine how many people it can accommodate.Make sure the venue you select has enough space for all expected guests. Of course, make sure that the maximum guest count can fit all of your guests — but consider the space, too. A venue that is too large for its guest list can also be a problem, as you’ll have trouble filling it out (and might end up costing extra to add in more décor!).‍‍Be aware of the rules.Inquire about the venue’s rules and restrictions to make sure you will be able to do all the things you plan for your big day like bringing in outside caterers, live music, and so on. Also, be mindful of their fire code if you plan on having open flames, like candles, fireworks, or sparklers. ‍‍With these elements in mind, you will be able to select the venue of your dreams in no time without stress and frustration! Most importantly, remember to stay true to yourself and what you really want. Your wedding will be a once-in-a-lifetime moment you’ll want to enjoy to the fullest! ‍",
                "author": "",
                "date": "November 17, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/why-attending-columbus-ohio-bridal-shows-and-wedding-expos-is-an-important-part-of-the-planning-process",
                "title": "Why attending Columbus Ohio bridal shows and wedding expos is an important part of the planning process.",
                "richtext": "Why attending Columbus Ohio bridal shows and wedding expos is an important part of the planning process.1. It saves you time.  Interviewing Columbus wedding vendors to search for the best match for your wedding day takes time. It is so important to find that perfect wedding day team of pros that can pull off your dream wedding. Generally, engaged couples in Columbus Ohio interview at least 3 vendors in each category before deciding who the right fit for their wedding will be. This does not include the time-consuming search for that perfect wedding venue in Columbus. When searching for a wedding ceremony and reception location it is common for engaged couples to look at 10 or more sites! The best way to save you time and stress would be to meet vendors and venues under one roof at a Wedding or Bridal Show or a Wedding Expo. Get to know them, see how they present themselves, check dates, and even interview them right on the spot. And no, it is not unheard of that engaged couples will book their services right at the show!  2. It saves you money.Many of the participating wedding vendors and wedding venues offer promotional discounts at their booths that you can take advantage of. Sometimes these discounts can save you hundreds of dollars on wedding services and vendors! In addition, many of these vendors have sign-ups where you can win free gifts. 3. Have fun!Why not reduce some of the wedding stress and do some wedding planning that is fun for a change! Bring your biggest supporters and plan a fun day out while crossing some things off that very long to-do list! Dress up and make it a date, or a girls' day out, or some mother and daughter bonding time or an escape from doing all your planning on the computer- heck you may even meet your step goal and get out of the house!!4. ExperiencesWho wouldn’t love some free food? Many vendors love handing out food to showcase their talents. Columbus caterers, venues, rehearsal dinner locations, bakeries, donut shops, and more.  How about something to wash the food down with? Some bridal shows have free drinks and some have cash bars, and some have both. There are even some vendors that pass out drink samples!Now let's have some fun, hop into a photo booth, or twirl around on a 360 photo booth, have your caricature done, some henna, or a mini makeover with an updo, lashes, and brows; fill your bag with makeup samples. For those who need a break, chill out and enjoy some live music.5. Goodies and PrizesFinding the right people to help make your special day exactly how you want it with as little stress as possible is your ultimate goal.  It is also these wedding show vendors’ goal too! Talk to them!  They are the experts, they will be able to help you in your planning process.  One of the best parts of getting to know more about all of these vendors is that many of them will be handing out free samples.  I like to think of it as adult trick or treat!  So, make sure to grab your bag at registration!Prizes at a bridal show can be awesome, especially when you are paying thousands of dollars for a wedding in Columbus. It might help that bank account of yours or your parents! Prizes alone are worth going to a Wedding Expo. Prizes can be things like a “no strings attached” prize like a free DJ for 4 hours, a free photo booth at your wedding, a free cake, free appetizers, and so much more. Typically you will see thousands of dollars in prize giveaways at the show. All I have to say to that is- GOOD LUCK!!If I haven’t convinced you yet, that bridal shows are not only fun, can save you time, money and quite possibly win a valuable prize…then speak to the thousands of engaged couples before you who seized the opportunity.  Go for it!  You only get married once! (hopefully)",
                "author": "Devoted Columbus",
                "date": "March 7, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/how-to-choose-the-perfect-wedding-date",
                "title": "How to Choose the Perfect Wedding Date",
                "richtext": "A wedding date is one of the first and most important choices you’ll make about your big day.Thankfully, there’s no “correct” date to get married. There’s only the one that’s right for you! ‍Here are a few things to keep in mind as you pick out the perfect time: ‍Your Budget To keep your spending in check, be sure to set a budget before booking your venue. Once you've established your finances, you can look  at venues and wedding packages that fit within your limit. This helps you determine a date that’s perfect for the location you’re getting married. For example, if the venue that’s within your price range is only available in the fall, then it looks like you’ll be having a beautiful autumnal wedding! ‍‍SeasonsKeep in mind that wedding venues typically offer discounts to couples who get married off-season or on certain days of the week. These are dates during which your venue is less busy or “less optimal,” and therefore less expensive.For most venues, the late winter months will be the least expensive for a ceremony. Mondays also tend to be the most affordable days to get married. So if you’re really trying to save money, a Monday in February is probably going to be your best friend! (Unless it’s Valentine’s Day of course.) If your venue doesn't offer a discount for these dates, you should still ask about their costs. You may be able to negotiate a lower price.‍Planning Time Also consider how long you’ll spend planning your wedding. Some couples prefer to have more time on their hands than others.If you have plenty of time to plan, you may want to consider a late-season date to minimize the costs of hiring a wedding planner and choosing more expensive vendors. On the other hand, if your time is limited, you may want to choose an early-season date so you have more time to plan and book vendors within your budget.‍‍Holiday Dates When choosing a wedding date, consider the things that matter to you as a couple. For example, if you plan on having a large wedding celebration, you may want to choose a wedding date near a holiday so you can include more friends and family in the festivities. (It’s more likely they’ll have time off work during a holiday.) That said, the cost of travel can skyrocket during the holidays, so be mindful of your and your loved ones’ budgets.‍‍‍Remember: Your Wedding Date is Your DecisionAt the end of the day, all the decisions you make about your wedding are personal—including the day on which you choose to get married. This is the date you’ll be celebrating for the rest of your life, so choose something that’s meaningful to you during the time of year you enjoy most. There’s no rush to get hitched when you plan to be together forever, so take your time selecting a time and location that’s perfect for you and your love. ‍",
                "author": "",
                "date": "January 12, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/determining-your-guest-list",
                "title": "Determining Your Guest List",
                "richtext": "One of the most important tasks to complete for your wedding is your guest list. This will be everyone who is not already a part of your wedding party! This is a fun thing to work on, but can also be stressful, especially in the middle of a pandemic! Whether your wedding is in the middle of COVID-19, or if you're planning your wedding in the years to come, we’re here to give you some ideas for figuring out who you should invite to your wedding.Who should be on my guest list?We’ll start this off by thinking beyond the pandemic- stay tuned for our advice for cutting down your guest list in the midst of COVID-19. This question of “who should be on my guest list?” can be tricky, so here are our tips for this task!Sit down with your fiancé and discuss a draft of your guest list. We recommend dividing the people you know into three groups:This first group of people would be your close, personal friends and more immediate family that you definitely would want to be at your wedding. You and your fiancé should come up with this list on your own- after all, this is the group of people the two of you could not possibly imagine not being present on your big day!We think that this group should be made up of your other closer friends, plus-ones, and extended family that you are relatively close to. This group may require some consulting from you and your fiancés parents, they can help you figure out which family members are more important to invite, and they may want to invite some of their friends as well (which you should probably allow especially if you/your fiancé’s parents are helping to pay for your wedding).This last group are people that you would like to have at your wedding, but would be willing to cut if your budget/venue doesn’t allow. This could include your work friends, and extended family that you don’t see often or know very well.Have a set number of guests going into planning/cutting guests. There are two ways to go about this:Base your number of guests off of your wedding venue, if you have that picked out at this point then you will have a limit of how many people you can have at your wedding.Base your wedding venue off of your number of guests. It may be hard to find a venue that holds 350 people, but if you care about having a lot of guests, then you’ll have to find a venue to accommodate all of your guests.Make a rule for plus one’s! Your wedding party should probably be allowed to have a plus one if they’re dating/engaged/married, but for you guests, this is more grey. An easy way to keep your guest list from being filled with people you don’t know would be to just have a general rule for plus ones. Examples of this: If you’ve never met someone’s significant other you don’t have to invite them, or, if your friend and their partner haven’t been dating for over a year, they don’t get an invite.If you attended someone’s wedding within the past 18 months, you should probably invite them and their partner, unless you’re having a very intimate wedding and you don’t view them as close personal friends.Cutting Your Guest List due to COVID?For those of you who love people and have dreamed of having a big wedding with everyone you know making an appearance, this will be something that is pretty difficult. For those of you who hate large crowds and have dreamed of having a small, intimate wedding, now is the best time for a wedding! Whichever way you lean, we have some tips for how you can cut your guest list down.Our first tip, as we’ve said in our previous tips, is to invite the people who you can’t imagine not being there. This would probably mainly consist of people in that first group of people above.Sorry to your friends, but you’ll probably have to cut most if not all plus ones. The only exceptions to this would probably be your wedding party’s plus ones.Without hurting anyone’s feelings intentionally, you should just throw out any expectations you think people may have on you. Weddings during a pandemic are so different than typical weddings (in Ohio you aren’t even supposed to dance at weddings!), so your friends and extended family will hopefully understand if they can’t be invited.Have a virtual option for the guests who don’t make the in-person cut!Consider having an anniversary reception after the pandemic is over! This way, you can have your small ceremony and have a fun reception once restrictions are lifted!We hope these tips will help you figure out who to invite to your wedding!",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/how-to-plan-a-wedding-on-a-small-budget",
                "title": "How To Plan A Wedding On A Small Budget",
                "richtext": "If you’re newly engaged and planning on getting married soon, you should begin the wedding planning process by creating a budget. Wedding costs can add up very quickly, which is why a budget is a great way to set the stage and keep you and your significant other on track when planning the big day.Let’s face it – planning your wedding on a small budget may not seem all that attractive, but it doesn’t have to be a bad thing. At the end of the day, a budget doesn’t dictate how wonderful your wedding will be. Below are a few helpful ways to save money on your wedding.Determine Your BudgetThe first step in creating a budget is figuring out what you and your partner feel comfortable spending. It is important to set a realistic price range when building your budget. This plan will ultimately help you see what you can afford and how you can change your spending in certain areas if needed. It’s key to do some background research on the prices of vendors, wedding planners, dresses, food, etc., so you can see what you’ll potentially be spending. Research is a great way to see where you can either scale back or splurge within your budget. You might also find that some sites have better pricing than others. When figuring out how much you can afford for your wedding, some things to consider are:What’s available in your savings account. Evaluate the amount you both can contribute to the budget. While prioritizing the wedding is ideal, you may have other important responsibilities you need to consider when deciding your budget.Living situations. If you are looking to buy a house together but are worried about affording a home and a wedding, look into options that will help you stay on budget. One option that has less of a financial requirement is an FHA loan. This loan is great for first-time homebuyers with low credit and other financial responsibilities. You then can consider how much to put towards your wedding budget once this is finalized. Ask your parents if they are willing to contribute. Any amount they can lend, even if it’s small, such as paying for the DJ or band, would be helpful and will allow you to focus on the bigger ticket items.Many factors make up your wedding budget, so having an idea of how much you can spend and where you are spending it can set you on the right path. Prioritize What’s ImportantIt’s a good idea to prioritize what’s important to have on your big day. Consider making a list of what you could live without, what you might like to have, and what you MUST have at your wedding. Some must-haves might be:Wedding dress Photographer DJ or bandVenueSome things you could maybe live without: Getting your hair and makeup done professionallyWedding favorsFull barA destination bachelor/bachelorette partyWeigh out your options and see where you feel comfortable scaling back or cutting out completely so that costs are in a comfortable range for you. Think about all the factors such as florists, food trucks, caterers, and narrow down what specific wedding vendors you need for your wedding day.Buy or Rent Resale ItemsWhen you’re planning a wedding you probably don’t realize the amount of things you’d need to make your walk down the aisle look like something out of a movie scene or Pinterest post. It gets expensive! But don’t panic – You’re in luck. Part of our company, Devoted Columbus, is a Wedding Resale Shoppe with gently used items people have used in their weddings in the past. You can visit our store to look for discounted decorations to give your big day a more unique feel. Have you already bought your decorations? No worries, after your wedding, you can bring us the items you used at your wedding and we’ll buy them for you and sell them to other brides in the future! It’s a win-win!Focus On What Costs The Most: Wedding VenueThe wedding venue usually has the largest price tag. What many people forget are the many little things that need to get added into your budget under your venue, such as:Tables & chairsLinensCenterpiecesCosts of setting up/cleaning up the venue FoodBarDance floor Day of WeddingThese items together can be very costly. If you are lucky, some venues offer cheaper options or even include these items within the venue cost. More money-conscious options to look into are having a backyard wedding, a barn wedding, renting out a cafe or restaurant, or even getting married at the courthouse. Consider A Smaller WeddingSometimes smaller is better. Consider cutting back the number of people involved in your wedding day. Limiting your guest list is an easy way to cut back on the cost. When you have a smaller guest list, there are fewer mouths to feed, fewer invitations to send out, and you won’t need to get an extravagant venue. You may also want to consider having a smaller wedding party. Some brides and grooms bend over backward for their wedding party and help out with the costs of dresses, suit rentals, hair, makeup, etc. You can even eliminate having a flower girl and ring bearer. With a smaller wedding party, you won’t have to worry about breaking the bank. Another thing to consider is to limit spending on decorations. Either purchase items from Etsy stores or focus on buying items that are on sale. You could also try some DIY wedding options. DIY is a cheap and easy way to get creative with centerpieces, table toppers, photo walls, and more! You could even consider selling the DIY projects after or loan them to a friend. The hard part is done. You and your partner have your budget, are ready to secure some vendors, and can get the actual wedding planning started. A wedding is one day, so don’t feel like you have to throw everything you have at it. There are so many ways to plan a wedding on a small budget. As long as you stick to the plan, then everything will turn out great!",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/wedding-expense-etiquette-who-pays-for-what",
                "title": "Wedding Expense Etiquette — Who Pays for What",
                "richtext": "Weddings are full of traditions. Brides wear the color white, carry something borrowed and split the budget between their families and future in-laws. Your parents and your fiance’s parents will likely want to help by taking part in this tradition. This guide explains everything you need to know about wedding expense etiquette so you understand exactly who pays for what part of your big day.1. Your Dress and VeilAfter showing off your gorgeous engagement ring, you’re excited to try on wedding dresses. Before scheduling any appointments, sit down with your family to discuss the budget. The bride’s family normally pays for the dress, veil and any accessories you want to wear down the aisle because it’s something parents look forward to for so many years.2. Your Rehearsal DinnerEveryone who participates in your ceremony will arrive at your venue, practice how it will go and then meet for dinner the night before your wedding. The groom’s family typically covers dining expenses, which average around $1,330 for the meal if you include large bridal or groom parties. Meet with your future in-laws to narrow down your options for catering, in-house dining or delivery based on what they can cover.3. Floral Arrangements and BouquetsYour fiance may not be interested in flower arrangements, but the groom’s family usually pays for all things floral. Your wedding date can be the inspiration for your budget, since in-season flowers are typically more budget-friendly and widely available than flowers grown in a greenhouse or shipped from out of town. Match them to your budget and have fun daydreaming about the many ways to use them as decor.4. Your Post-Ceremony ReceptionYour reception is the celebratory meal everyone looks forward to, so catering and bartender services for wedding receptions can become the most expensive parts of weddings. The bride’s family has always covered these costs, but you may feel inclined to split them with your family. Discuss these costs well in advance of your wedding day so you can secure the best reception vendors while their calendar remains open.5. Your Photographer and VideographerThe bride’s family also pays for any photographers or videographers that will capture your big day on camera. You don’t need to hire one or the other if you’re working with a tight budget, but traditionally your parents would offer to pay for these services.Get a few quotes from industry professionals to compare prices and work with your parents on what they’re able to afford. Photographers alone can charge up to $2,556 on average. The numbers may be a shock, but if you work together with your parents, you’ll figure out how to include these services in both of your budgets.6. All Honeymoon ExpensesAfter a man marries his bride, he traditionally becomes the head of the household. That way of thinking made it logical for the groom to pay for all of the honeymoon expenses. He was supposed to treat his wife to their first adventure together by taking charge of the budget, but you can split costs if it makes you more comfortable.Review Wedding Expense EtiquetteNow that you know more about wedding expense etiquette, talk with every party involved to find the best solutions for your big day. You don’t have to pay for everything on your own. Your loved ones will want to celebrate this new chapter of your life by pitching in to make your wedding dreams come true.Written by: Cora Gold",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/avant-garde-impressions",
                "title": "Avant-Garde Impressions",
                "richtext": "Avant-Garde Impressions has been in business for 11 years, offering invitations, stationery, gifts, and decor for weddings, Bar/Bat Mitzvahs, holidays, and all other special events we celebrate throughout life. They are known most for their wedding invitations, and carry both traditional catalog styles as well as custom printing and design. They have the LARGEST selection of invitation catalogs in Columbus, and the ideas grow with every event they work on. People can choose styles that they have already done, or couples can bring in their own ideas for a quote on something truly as unique as they are. It doesn’t stop with invitations! They are also a retail store! They offer gifts for the bridal party and parents, a large assortment of guest books, card boxes, flower girl baskets, ring bearer pillows, in memory items, and anything else you might need for your wedding. They also have everything you would need for bridal and baby showers, as well as greeting cards, journals, and social stationery.Meet Jason FletcherJason Fletcher is the owner of Avant-Garde Impressions. He believes it is never too early to plan out your stationery. He is ready to start on designs and ideas at any time, and the final printing can be held off until you are ready. Many couples wait till the last minute for this service, and find themselves in panic mode too close to their wedding date. They only charge a $25 deposit to start the design work, and that will be applied to the final purchase. And when you come in for an appointment, they can set you up with a proper timeline on when the best times to order will be. Outside of work he enjoys summer charity sports – kickball and softball, kayaking, and just about anything outside.Why Avant-Garde Impressions?The three things that set them apart the most are:Large Selection: The ability to create so many different styles utilizing multiple printing methods and vendors. And their retail shopping makes them a one-stop shop.Pricing: They have worked for years to have the largest selection available for budget and moderate priced weddings as well as the elaborate styles.Turnaround Times: Being they offer in-house printing as an alternative, many of their styles can be ready within 24-48 hours. Even with the collections that they out-source for specialty printing can be done and ready for pickup typically within 1-2 weeks.Check out these reviews!“Originally, we looked at some online printing options but wanted to support a local business with whom we could establish a relationship. We are so glad we chose Avant-Garde Impressions. We were looking for something classic and elegant with a modern twist. The staff there were amazing to work with, were able to create an invitation suite that was exactly what we envisioned and set the tone for our big day, and they were accommodating and flexible when I was being extraordinarily particular!” -Sierra E. (4/9/2019)“I am so thankful we found Avant-Garde Impressions. They went above and beyond to make our wedding “Save The Dates” and our invitations more than we had dreamed of! They were so thorough and made sure they helped design them EXACTLY how we wanted them. Not to mention, they were ready so quickly. We saved SO much money by using this company, compared to others, as well. We highly recommend Jason and his team, to help make your day more memorable!” -Brittany S. (12/23/2018)Contact:Phone: 614-259-7082Address: 34 Dillmont Drive, Columbus, Ohio 43235Email: jfletcher@agimpressions.comWebsite: www.agimpressions.comFacebook: www.facebook.com/AvantGardeImpressionsInstagram: www.instagram.com/avantgardeimpressions",
                "author": "Avant-Garde Impressions",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/mistakes-to-avoid-when-planning-your-wedding-invitations",
                "title": "Mistakes to Avoid When Planning Your Wedding Invitations",
                "richtext": "Your wedding invitations are the first taste of your wedding that your guests will get. They will include all of your most important wedding details, from the location to the RSVP instructions. In fact, your wedding invites will be one of the first crucial wedding elements that you and your partner will plan.Advice for Planning Your Wedding StationeryHave you started planning your wedding stationery yet?Here at Devoted Columbus, planning crucial wedding details is very important to us. We want to help you be confident in the wedding invites that you send out, so we have some helpful advice.   Are you curious as to what mistakes you should avoid when creating your own wedding invitations? If so, be sure to continue reading to gain some great insight:Treacherous Typos.Just as you want to ensure that your wedding day is perfect, your wedding invitations should be too. This means that there should be no typos, at all. Imagine how horribly wrong it would be to pay for upwards of a hundred printed invitations, and your name or your partner’s name is misspelled. Or, your venue location could be misspelled. Typos can be treacherous. Have someone proofread each detail to ensure that there are no mistakes.Huge Time Limit.As with any wedding invitation, your guests should be allowed time to reply with an answer. Some guests will need to put in for time off, make travel arrangements, or even arrange for babysitters. However, the time to reply should not be too long, as too much time could allow them to forget. Wedding invitations should be sent out six to eight weeks prior to the big day.Detail Overload.Your guests are already excited about your wedding day. But, adding every single wedding detail, from your theme to the aesthetics of your wedding, can create a wedding detail overload. Your invitations should be neat and clean. Keep some of your wedding details a surprise for the big day.Delivering flawless wedding invitations to your guests will allow them to join you on your special day and can even get them excited for your nuptials. Here at Devoted Columbus, we are ready to help you discover the best wedding vendors in Columbus, Ohio, such as Calligraphy by Keri. Be sure to contact us today to book your Columbus wedding vendors.",
                "author": "",
                "date": "December 6, 2021"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-parties-rehearsals",
        "blogMainTitle": "Wedding Parties & Rehearsals",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/how-to-plan-an-engagement-party",
                "title": "How to Plan an Engagement Party",
                "richtext": "If you are now engaged, you will certainly want to celebrate with an engagement party! Your partner has turned into your fiancé, and you are now making your way to marriage. Friends and family members will be very excited about your new relationship status, and will surely want to celebrate with you.Are you aware of how to begin planning your engagement party?We believe that every couple deserves to celebrate their engagement! That’s why, here at Devoted Columbus, we have gathered some tips to assist you with planning your own engagement party. To discover what these tips are, be sure to continue reading:Develop Your Guest List. The first step to planning your engagement party is to develop a guest list. The number of guests you have attending will then allow you to determine many factors, such as the size of venue you will need to book as well as how much food should be served.Choose a Theme. Just as with any party, you should have a theme. The theme and color scheme you choose will allow you to choose your elements of décor with ease, and ensure that every detail represents a cohesive appearance. For engagement parties, couples often like to showcase an intimate appeal, with warm colors paired with romantic flowers.Discover Your Vendors. An event wouldn’t be complete without vendors! After all, they will be the ones who will provide all of the details for your special day. It is important to consider all of the vendors that you will need, such as caterers, entertainment, and a florist.Please Your Guests. Entertainment is important for your guests to enjoy your event. In addition to passed appetizers or a scrumptious meal, you should consider booking a band to present welcoming music. Also, favors are always a great way to show your guests your appreciation for their attendance.An engagement party will certainly be enjoyed by both you and your guests. These are just a few tips for planning yours. If you are ready to discover the perfect Columbus, Ohio wedding vendors, check out all of the amazing vendors on our online directory.",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/including-your-mother-on-your-wedding-day",
                "title": "Including Your Mother on Your Wedding Day",
                "richtext": "Most importantly your wedding day is about you! It is your special day where you are the star of the show, but it is always fun to make sure you honor your mother because it can add a special touch to your special day. Here are some thoughtful and creative ways you can include your mother in your big day!Steal her styleWearing your mothers wedding dress may not be your style but that isn’t the only clothing or accessory contribution she can make. Try accessorizing with some of her favorite jewelry such as a sentimental necklace or fabulous earrings. Veils are often a classic timeless piece, wearing your mother’s veil can be sentimental and add a touch of vintage to your wedding look. It is also a popular tradition to sew part of your mothers wedding dress into the underneath of yours to have a part of her with you!Give a touching giftAnything from a sweet note to a printed photo can mean the world to your mother on your wedding day. It can be hard for a mother to see her baby grow up. A small loving gift can easily make her feel loved, appreciated and know that you will always be there for her.Switch up traditionWho says your mom can’t walk you down the aisle or you can’t do a mother-daughter dance. Although these are traditionally roles meant for the father-of-the-bride that doesn’t mean mom can’t be a part of them.Honor her memoryIf your mother can't be there that doesn’t mean she can’t be there in spirit. Leave an open chair for her in the front row. You can decorate this seat with a picture of her and her favorite flowers to add a special touch.",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/unique-engagement-party-ideas",
                "title": "Unique Engagement Party Ideas",
                "richtext": "Maybe you’re freaking out about your future of figuring details for your bridal shower, bachelorette party, and not to mention your wedding! Planning a whole other party may seem daunting when you haven’t even figured out who is catering your wedding, but we’re here to help get your creativity flowing and spark some ideas for what you can do to celebrate your engagement in a unique way! Your engagement party is the first function you will host as you and your partner take your relationship to the next level. Before you get stressed about this- Let’s just take a deep breath and remember that it’s okay to just want to have fun with your family and friends while celebrating your engagement! Take this as another opportunity to have fun and enjoy being engaged!Brunch/Tea PartyIf your friends have seen Bridgerton on Netflix, they will absolutely love this idea! You don’t even have to like tea to do this, but bonus points if you do. With the brunch theme added on, you can have basically any food you want, but as little girls I’m sure a lot of us dreamed of having the perfect imaginary tea party, so why not make your four year old self’s dreams come true! A tea party needs finger foods, so get creative making tiny sandwiches, order macarons and other pastries from your favorite bakery, and of course, you’ll need mimosas.Recreate Your First DateYou already know you’ll get asked at least five times what your first date with your fiancé was at your engagement party… So why not make that the theme so that people don’t even have to ask? Whether you had an extravagant first date with a night out on the town, or a chill night eating takeout, you can incorporate different aspects of your first date into your engagement party so your guests can experience it all over again with you and your fiancé! Cater with the dinner you had, show the movie you saw together, decorate with the flowers you got… You can even add touches of other “firsts” you had as a couple! Where you had your first kiss, when you first said “I love you”, when you tried a new activity together- you can get really creative with this!Picnic PartyWho doesn’t love picnics? Head to your favorite State Park or Metro Park and find a great spot to have your picnic! For an easy meal that feeds a lot of people, pick up pizzas from your favorite pizza shop and grab some snacks and sodas and you’ll be all set! There’s a lot of room for activities at parks, so have different games on hand for people to be able to play, a football for the kids to toss around, a frisbee for people who are looking to run around, or even an easy board game like Connect Four.Classy Charcuterie CelebrationIf there’s one thing we learned from 2020… Its that charcuterie boards are ALL the rage, and delicious. This is a great option if you’re looking to feed your guests while not catering or making a whole meal for them. Head to your go-to grocery store (I like Aldi for making charcuterie boards on a budget), and pick out all the cheese, meats, crackers, jams, and chocolate you want to make an appearance on your board, and get to arranging! If you want to be extra creative, you can make small, personal charcuterie cups so that you can avoid having all your guests touching all of the food- we are in the middle of a pandemic after all! I guarantee all your friends will be featuring this spread on their Instagram stories!Backyard BashSkip the fanciness and have an engagement party in your backyard! If you know someone who loves to barbeque this is their opportunity to show off how good of a cook they are, you can also set up a casual buffet with home cooked foods like macaroni and cheese, rolls, chips, fruits and veggies, and salad to go along with the barbeque theme. If you have a lot of friends or family with children, or just know people who like to play games, set up a game of cornhole, giant Jenga, Bocce Ball, or any other games you know will be a crowd pleaser! This is super family friendly and personable!Rosé on the RoofFor a smaller, more intimate gathering of family and friends, opt for a reservation to a rooftop bar to celebrate with those closest to you! If you or a friend live in an apartment with a rooftop lounge area, you could use that space as well to bring people together. If you’re opting for the rooftop bar, enjoy a classy meal with your loved ones while watching as the sun goes down over your city. Who doesn’t love the view of a beautiful sunset?Charitable PartyIf you and your fiancé love giving back to the community, have a party where you can play games like poker where the money put in all will be donated at the end of the night, you can even have scratch-off cards where winning cards will be donated as well. To take this a step further you can even have catering/food from locally owned businesses that are dedicated to giving back in some way. This is a great way to celebrate with the people you love while doing something together to raise money for charities in need.World TravelersFor the couple who loves to travel, for the couple who simply appreciates other cultures, for the couple who knows a lot of people from all around the world, or for the couple who loves all sorts of different cuisines, this theme may be for you! Get a jump start on deciding where you want to go for your honeymoon by hosting a party with the theme of travel! Order from local ethnic restaurants to get a taste of food from different countries, or if you know people from other countries who love to cook, see if they would be willing to bring a dish to show off their culture! This is a unique way to bring people together in appreciating the diversity of our world, and maybe you’ll even try something new that you love!",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/ohio-staycation-and-honeymoon-inspiration",
                "title": "Ohio Staycation and Honeymoon Inspiration",
                "richtext": "Honeymoons and weddings have looked very different this year and last, and we know it can be discouraging or frustrating. However, that doesn’t mean you need to get down or give up. We’re here to give you some post wedding relaxation inspiration. There are still beautiful places to go, and they’re right around the corner. If you’re looking for different staycation ideas and close to home honeymoons, you’re in the right place! The Great OutdoorsIf you call the outdoors home, and you’d much rather be out there than in here, consider spending your honeymoon in a secluded cabin or treehouse (yes, a treehouse!). You don’t need to take a cross country road trip either. Hocking Hills, in Logan Ohio, offers a wide range of chalets and cabins that are perfect for a cozy outdoor getaway. Honeymoon cabins can be found on the Hocking Hills website or on Airbnb. Take a hike through the woods, or kick back in the hot tub with a bottle of champagne and toast to your new lives together! TreehousesIf the treehouses caught your attention, there are a few different places to look. One is the Berlin Ohio Treehouses and the other is The Mohicans. Both offer amazing views, standard amenities (heat/AC, indoor showers, indoor bathrooms, and TV) and of course privacy. With both of these locations it is important to look and book early because they fill up fast especially with spring coming. Another outdoor getaway option is booking a staycation on Buckeye Lake. When it comes to booking a place to stay, Airbnb has you covered. While there, experience the lakeside restaurants and bars, wineries, breweries, paddle boarding, boating, jet skiing, and so much more. One other place to consider when looking at outdoor destinations is Put-in-Bay. Take a ride on the ferry from Catawba to PIB and then rent a golf cart for the week. Choose to explore the square, go to the lighthouse, eat at the local restaurants and bars, see Perry’s Monument, or go to the Put-in-Bay Winery. Visit Trip Advisor or the Put-in-Bay website for perfect honeymoon stays!Columbus, OhioIf the outdoors isn’t your thing, don’t worry because there are three majorly cool cities to consider honeymooning in. Stay in Columbus and explore breweries you’ve never been to or walk/ride the Scioto Mile. Get lost in the magic of the Franklin Park Conservatory or visit the Columbus Zoo. If you choose to stay downtown, hangout in German Village, at The North Market Farmers Market, or in The Short North. When choosing a place to stay, consider Hotel LeVeque, The Timbrook Guesthouse, Canopy Short North, and DogHouse Columbus as inspiration. Cleveland, OhioIf you’re looking to go up north to Cleveland, Ohio, consider staying at the Metropolitan at the 9, Hyatt Regency Cleveland, or Kimpton Schofield Hotel. Visit the Cleveland Museum of Art, the Rock and Roll Hall of Fame, West Side Market, the Cleveland Zoo, and the Cleveland Botanical Gardens. At night choose from hundreds of different restaurants and bars or even try your luck at the JACK Cleveland Casino! Cincinnati, OhioWhen looking to stay in Cincinnati, Ohio, explore the websites of the 21c Museum MGallery Hotel, the Radisson Hotel Cincinnati Riverfront, The Cincinnatian Hotel, and The Lytle Park Hotel. Pack a picnic and spend one of the first afternoons as a married couple at the Smale Riverfront Park or Eden Park. The Krohn Conservatory, Findlay Market and Rhinegeist Brewery are other destinations to add to the list. Most places are within a 10 minute walk or drive from each other! If you’re still feeling lucky, opt to spend a night at the Hard Rock Casino. Despite all that is going on, there are still great places to go that are only a short road trip away. Choose to relax with your partner as newlyweds in the state that you call home. Use this post as staycation inspiration, and explore all that Ohio has to offer. Keep following for more wedding tips and inspiration. If you choose to go to any of these places let us know by leaving a comment! ",
                "author": "",
                "date": "November 26, 2021"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-gifts",
        "blogMainTitle": "Wedding Gifts",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/6-etsy-shops-for-simplifying-wedding-party-proposal-boxes",
                "title": "6 Etsy Shops for Simplifying Wedding Party Proposal Boxes",
                "richtext": "Wedding party proposal boxes are a fun and cute way to ask the special people in your life to be a part of your big day. While choosing each item in the box separately can be fun, it can also be super time consuming. If you’re short on time, consider buying a ready to go box set for your squad. There is no doubt Etsy is such a great resource when it comes to gifts. For your bride tribe, in particular, there are so many options to choose from. Read on for some of Devoted Columbus’s favorite Etsy shops to get all of your proposal box needs covered!‍‍‍Etsy Shop Name: LoveLinaxPrice Range: $39-$68These beautiful boxes come with a variety of personalized beauty items that your bride tribe will get a ton of use out of on the wedding day and beyond. The soft earth tones will match any color palette and can easily mix into your special ladies everyday lives. The boxes come in different price levels with several different personalization options. The shop also offers individual pieces if you're building your own proposal boxes!‍‍Etsy Shop Name: SucculentkreationsCoPrice Range: $25-$50+With boxes for literally any occasion this shop has you covered for the wedding party proposals. The basic box comes with a live succulent, a candle and colorful matches as well as a personalized card. You can choose from a variety of add-on options like mini rose quartz, candies, lip balm, necklaces, key chains and bath bombs to make these the perfect way to tell your bride tribe that your wedding would \"succ\" without them!‍‍Etsy Shop Name: LetsRememberPrice Range: $25-$50+These customizable boxes are the perfect way to get your bridal party in the spirit. Choose from a personalized metal tumbler, white flask, pink or clear coffee mug, or champagne flute in these fabulous boxes. The shop has several different customizable box types to choose from to fit your wedding party perfectly.‍‍‍Etsy Shop Name: TheDancingWickPrice Range: $17.50-$32+This neutral toned box is full of customizations for your squad. From a solo candle asking them to \"Light Up The Aisle\" you to a full spa set you can pamper your squad however you would like.‍‍Etsy Shop Name: SincerelyMeGiftPrice Range: $44-$79+If you're looking for glam proposal boxes with tons of customization options you can't go wrong with these fabulous proposal sets. While these are on the higher end of the price spectrum the quality and amount of personalized items packed into these gorgeous boxes makes them worth the splurge.‍‍Etsy Shop Name: LifeBundlzPrice Range: $18-40+If you're looking for adorable boxes to fill with your own special goodies, this is the shop for you. Whether you're wanting Kraft boxes or a more lasting wooden keepsake box these beauties are a neutral and beautiful gift for the special ladies in your life.‍‍While wedding party proposal boxes are by no means mandatory this fun trend will help you show your appreciation to those closest to you and thank them in advance for standing up beside you on your special day!",
                "author": "",
                "date": "November 10, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/ampersand-essentials-aromatherapy",
                "title": "Ampersand Essentials Aromatherapy",
                "richtext": "Ampersand Essentials Aromatherapy specializes in fully customizable gifts for your wedding guests. They love to create exactly what you’re looking for on your big day, at a fraction of the price of many other gift and favor companies! They really love creating products that are pure and all-natural, so you can actually trust the ingredients in the products you’re receiving. They know how important health has been, especially over the past year, so they wanted to highlight that by pledging to use all-natural, pure ingredients that come from trusted sources! Ampersand Essentials Aromatherapy is devoted to creating all natural products to help you live a healthier, happier life!Not only do they create custom favors for your wedding guests, but Ampersand Essentials Aromatherapy also offers hotel welcome bags, bachelor(ette) party gift bags, stress-free gift baskets to help you relax the night before your big day, and customizable gift baskets to give to your wedding party, family, or even to yourself! They also offer set-up services so you don’t have to stress about a thing on your big day. Ampersand Essentials is meant to be a customer-focused business that serves your needs first!What sets Ampersand Essentials Aromatherapy apart from their competition is that their products are truly fully customizable. They have over 200 recipes on their Pinterest page to help get you started, but it doesn’t stop there! If you find more than one recipe that you like, or you find something that isn’t in their boards, they can do that too! You get to choose the colors of your labels and what they say, and all of this is included in their pricing. Everything is all-natural, pure, and USDA Organic Certified (when possible), which means all of the ingredients and products are ones you can pronounce AND trust. They are here to serve you, the engaged couple, and ensure your vision of your big day becomes a reality!Ampersand Essentials Aromatherapy is offering FREE Wedding Client Consultations to anyone who is interested in getting more info about their business, what they have to offer, and to even try out some of their scents! Their new office located in Polaris has their entire inventory of essential oils, as well as sample bottles that you can expect to receive in your packages from them. They can’t wait to hear from you!Meet Michelle JohnsonMichelle Johnson is the owner of Ampersand Essentials Aromatherapy. She started the business about a year ago because when she was planning her wedding, one of the big things she really wanted to treat her guests to was a little gift that they could take home, appreciate, and actually use. However, when she was looking at her options, she wasn’t finding anything that was as truly customizable as she wanted, and everything was WAY out of her price range! Michelle wanted to offer what she didn’t have to engaged couples out there looking today, so she created Ampersand Essentials to do just that – be approachable, affordable, and customizable! She also has a thriving online shop that offers many different products for every area of your life. Michelle is a Certified Aromatherapist and has completed over 130 credit hours of coursework, passed final exams, and has graduated from one of the top Aromatherapy schools in the country! She loves to teach about essential oils and the holistic aromatherapy world, so she started a blog to be a trustworthy resource that you can come to when you have questions!Another interesting fact about Michelle is that she lives in the middle of nowhere in the woods with her husband, daughter and the fluffiest, happiest dog on the planet. They live in a log cabin and truly feel like they are on vacation 365 days of the year. She is a huge adoption advocate who was adopted herself! Many people would never guess it, but Michelle is actually a full time Electrical Engineer by day! She designs residential buildings for a living and really enjoys lighting design. She loves spending as much time with her family as possible, and getting to enjoy it outside makes everything even better! Michelle also writes part time for an international women’s magazine and has been published over 10 times in various magazines and guest blogs all across the world!Michelle loves weddings because of the beautiful stories that start there. When she and her husband got married, she said it was the best feeling in the world because after dating for such a long time, they were finally able to start their full lives together. She loves being able to be a part of the sweet beginnings that last a lifetime! One piece of advice she would give engaged couples is “Planning really can take over your life – make sure to spend time with your significant other talking about things OTHER than your wedding! This time of engagement is when you can really dig deep into knowing one another better, spending more time together, and learning how to compromise. Remember to keep dating and remember to keep loving one another! You will have disagreements, but know this: if you were exactly the same, life would be boring! Have fun and enjoy each other!”Check out this review!“After battling anxiety for most of my adult life, I have tried many alternatives to help manage my stress. The best thing I could have done was turn to someone who not only cares about my mental health, but my physical health as well. It gives me peace of mind every time I use my custom made rollerball that I am using something natural that won’t be harmful to my body. Plus it smells amazing too, and I love how versatile it is! I highly recommend Ampersand to anyone looking for themselves or gifts from others.” – Hannah N.ContactPhone: 614-935-8713Address: 670 Meridian Way, Suite 147, Westerville, OH 43082Email: michelle@ampersandessentials.netWebsite: www.ampersandessentials.netFacebook: www.facebook.com/amp.essentials/Instagram: www.instagram.com/amp.essentials/",
                "author": "Ampersand Essentials Aromatherapy",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/top-10-wedding-registries",
                "title": "Top 10 Wedding Registries",
                "richtext": "Are you scrambling to get everything together for your wedding day? If you have forgotten to register for your wedding gifts, here are some great places to keep in mind! Whether it is online or in person we have all the choices you need!Here are 4 online registry sites:1. MyRegistryIf you are looking for a more broad wedding registry, MyRegistry is perfect for you. This site allows you to add things from all different websites and stores, instead of just registering to one specific store or site. You can even add things such as cooking classes and other lessons, and even a link to your favorite charity so that your guests can donate to that as well!2. AmazonYou definitely have heard of Amazon, but did you know that they have a separate wedding registry section on their site? This is perfect for adding things that you may have already added to your wishlist on Amazon in the past!3. ZolaThis online wedding registry site is perfect to add items directly to your registry, instead of being directed to a third party site every time you want to check something out. You can even add items from sites that don’t have their own wedding registry program!4. Blueprint RegistryThis registry site also allows you to add items from different stores and sites giving you an unlimited amount of options. They even will send you thank you cards to customize if you choose. They will let you know who sent which gift as well as a return guide!Here are 6 in person stores that you can register with:5. TargetEveryone loves Target because of their convenience and variety of products, but some people may not know that they have a wedding registry program as well. Target allows a group gifting option too where a group of people can team up to get you something bigger or more expensive!6. Bed Bath & BeyondThis place is perfect to register with if you’re looking for all of the new home essentials. You know that you can always play it safe with Bed Bath & Beyond when it comes to kitchen, bedroom, and bathroom items.7. Macy’sMacy’s is perfect if you are always looking for a deal and rewards! They have everything you would possibly want to add to your registry, so you know that you can trust them with adding anything and everything that you want.8. Crate & BarrelIf you didn’t already know, Crate & Barrel is one of the most popular places to have your wedding registry. You can add items in person and online, which is extremely convenient. Don’t forget to download their app as well so you can update your registry as much as possible!9. Pottery BarnHere, they have the perfect pieces when it comes to decorating every room in your house, which is why their wedding registry is perfect. Pottery Barn also allows you to customize some furniture pieces so that it fits in perfectly in your home!10. IkeaIkea is perfect for convenience as well as variety! Ikea also has nearly everything you would ever want for the inside of your house, as well as many little tools and gadgets that are helpful in the kitchen and around the house.",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/top-ten-unique-wedding-gifts",
                "title": "Top Ten Unique Wedding Gifts",
                "richtext": "Selecting original and unique wedding gifts can sometimes be a complicated task. The best gifts are quickly snagged off the registry leaving some guests empty-handed. But do not worry! We have compiled a list of top ten gifts that you will feel confident giving and the happy couple will love receiving!1. Anniversary Wine Box An Anniversary Wine Box includes a bottle of wine to be opened on the couple’s one-year anniversary, third-year anniversary, and fifth-year anniversary. The first few years of marriage are extremely special and the couple will appreciate this little memento to commemorate that. 2. Cocktail Party Glassware SetThe new couple will most likely be finding themselves hosting dinner parties at their new home together. Prepare them to be the classiest hosts around and give them the gift of nice glassware for all their cocktail entertainment needs.3. Personalized Home SignAnything personalized for the couple is a great unique wedding gift! Customizing a sign for the couple to hang outside their new home will be greatly appreciated. It is both thoughtful and original and the couple will cherish it for years! 4. Canvas Print of their Wedding SongThis is a completely original and thoughtful gift that the couple would love! There are services that can print the lyrics to any song onto a canvas accompanied by the couple’s name and wedding date. A couple’s wedding song is extremely important to them and anyone would love this unique gift! 5. Amazon Echo An Amazon Echo is a great addition to any new home. It can be put anywhere in the house and assist in making new married life as easy as possible. Alexa can play music, check the weather and so much more. It is a fun and techy gift that the couple never even knew they needed! 6. Luggage SetThe couple will most likely be jet setting on a honeymoon shortly after their wedding and new luggage would be a great addition on this journey! This is a lovely wedding gift to give and couples rarely think to put it on their registries. 7. Custom Recipe BookAn extremely thoughtful and original gift would be a recipe book compiled with signature recipes from both sides. If you are close enough with the couple’s family, reach out to them and ask for a famous recipe. It might be Grandma’s cookies or Mom’s Lasagna or something even better! The couple will be doing a lot of cooking together and having recipes on decks from both families would be incredible. Any couple would love this gift! 8. Couple Cooking ClassesNewlyweds are forced to transition from cooking for one to cooking for two. As well as moving from the not-so-sophisticated menu of their early 20s to the real cuisine of adulthood. Cooking classes make this transition not so difficult and the couple will have fun while expanding their palette! 9. Dinner ReservationsYou can never go wrong by giving the gift of a new experience. The couple will definitely be in the honeymoon phase after their wedding and would enjoy a date night at a new restaurant. Do some research and figure out what restaurants are new and different for the couple and get them a reservation and gift card. This thoughtful gesture will not go underappreciated and will be a unique gift for the couple. 10. Plant a Tree in the Couple’s NamePlanting a tree in the name of the couple is a completely unique and thoughtful idea. The tree will symbolize the love between the couple. As their love and life grow so will the tree. They can go visit it on birthdays, anniversaries and everything in between. This is perfect for any couple who loves symbolic, meaningful gifts! ",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/ohio-bartenders-for-hire",
                "title": "Ohio Bartenders for Hire",
                "richtext": "Ohio Bartenders for Hire has been providing exceptional bartending services for the past four years, creating specialty signature cocktails with and without alcohol for any event. All of their bartenders are certified and highly trained with the ability to create and safely serve hundreds of different cocktails for any special occasion, including “mocktails.” These are festive nonalcoholic drinks that are a mixture of fruit, juices, herbs, and sodas that are combined in the right ratios to provide a delicious flavor that all ages can enjoy. Ohio Bartenders for Hire carries liquor liability insurance for all of their bartenders. They are able to assist the hosts regarding the volume of supplies they will need to purchase and are able to recommend cost-effective sources for their needs. They also offer packages including cups, straws, beverage napkins, ice, mixers, garnishes, troughs, coolers, and more, so the host does not have to worry about running out or over buying for their event.Ohio Bartenders for Hire loves to help create a successful and carefree affair in order for the host to enjoy the event as much as the guests. What sets them apart from other businesses is the training their employees must complete prior to starting their position. All of their bartenders have completed a 40-hour class through Columbus Bartending School and received a certification. Also, the bartenders are TIPS certified so they know how to serve alcohol responsibly in order for the hosts and their guests to have the best experience possible.Meet Vanessa LongVanessa Long is the owner of Ohio Bartenders for Hire, and she has been in the industry for over 20 years. She started as a busser at a private Yacht Club when she was just 16 years old and worked her way up. Shortly after, Vanessa decided to go to school to become a certified paralegal and worked in a prominent Columbus, Ohio criminal defense firm for 10 years while continuing to work in the restaurant industry at the same time. Aside from work, Vanessa loves crafting, scrapbooking, and helping her mother sew items for craft shows. She also enjoys doing family fitness with her husband and three children. They recently added running to their strength training routine last year and even completed two 5k’s as a family.There are many reasons why Vanessa loves working in the wedding industry, but the satisfaction of helping an excited couple fulfill the vision for their special day is her top reason. Her advice to engaged couples is to always hire a bartender even if you were planning on self serve such as bottled beer in a trough. Her reason is an experienced bartender can spot when someone has consumed too much. They can use their experience and training to discreetly cut someone off which saves the host from having to deal with embarrassment or conflict during the event. Bartenders can also take care of other issues, such as making sure that no minors are being served.Check out these reviews!“Words cannot express how much we enjoyed Ms. Vanessa’s services for our event. She exudes professionalism. She went above and beyond to provide individualized services to all our guests. We will absolutely obtain her services for our future events. Thank you Vanessa!!!” -Dr. D.“Vanessa was the consummate professional. She was courteous and attentive. We were all impressed that she jumped right in, asked for little direction and was spot on for the entire time she was there. I would highly recommend her for any of your event needs! -Beth H.ContactPhone: 614-885-9610Email: info@columbusbartendingschool.comWebsite: www.ohiobartendersforhire.comAddress: 5354 North High Street, Columbus, Ohio",
                "author": "Ohio Bartenders for Hire",
                "date": "November 26, 2021"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-food-drink",
        "blogMainTitle": "Wedding Food & Drink",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/upgrade-your-refreshments-unique-ways-to-serve-wedding-day-drinks",
                "title": "Upgrade Your Refreshments: Unique Ways to Serve Wedding Day Drinks",
                "richtext": "Time to get those bottles up and champagne glasses ready! A wedding isn’t complete without refreshing drinks to keep spirits high and guests hydrated, so make your wedding décor even more special with cool and unique drink displays. ‍Whether you’re serving wine or lemonade, there are plenty of opportunities to get creative for cocktail hour. Everyone wants to have that wow factor on their special day, so let’s look at some drink serving ideas that are sure to elicit oohs and aahs from your guests, friends, and family. ‍Bathtub Chill Fill a small bathtub with ice and store a variety of bottled drinks inside for a unique twist on the traditional cooler. But, you don’t have to stop there. Decorate the tub with greenery, flowers, and other decor to make it stand out and match your wedding theme. Pro tip: You can also use this same method with a kayak or other small boat! ‍Roll it OutMake a mobile cooler by filling a wheelbarrow with ice and colorful florals. Place your ice down first and then adorn it with a miscellaneous arrangement of flowers for a bright display. Then, place your drinks on top and voila! You can also include a cute sign to sit between the wheelbarrow handles. ‍Make a Champagne WallGreenery and champagne glasses make for a pretty aesthetic when paired together. Get some tall wooden shelves and outline the entire piece in lush greenery. Then, place your champagne glasses on the shelves when you’re done! ‍Fruity Ice Bucket Elevate the typical ice bucket with colorful sliced fruits. Fill a glass or plastic bucket with ice and outline it with strawberries, blueberries, and other fruits of your choice, along with some pretty flowers. Then stick in a wine or champagne bottle of your choice. ‍Branded Coconuts Get some cute coconut-shaped cups and monogram them with you and your partner’s names or custom monogram. Then, fill them with your drink of choice and serve them to guests for a tropical-themed refreshment. Add straws and a pretty plant leaf for more style. ‍The key to having the best drink display for your wedding is using your creativity and thinking outside the box. With that said, be sure to keep your theme and feasibility in mind and use all your resources! ‍Also, you don’t have to go the expensive route. You can use simple tools and put a unique twist on them. Whether you use an old kayak, a wheelbarrow, or set up a sparkling wine display, your wedding is sure to be a hit with these one-of-a-kind ideas!‍‍",
                "author": "",
                "date": "February 21, 2023"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/top-10-must-have-wedding-midnight-snacks-to-keep-the-party-going",
                "title": "Top 10 Must-Have Wedding Midnight Snacks to Keep the Party Going",
                "richtext": "Weddings are a celebration in the fullest sense. With friends and family coming together to celebrate a loving union, who wouldn’t want to get a little rowdy? When night falls and the energy levels start to drop, how do you keep your guests going? Well, by having a bunch of excellent and creative late-night snacks! Here’s a list of our ten favorites:Build-Your-Own NachosLike many good things in life, this one can get a little messy. Get a small plate with chips already laid out, and then have bowls full of various toppings. Make sure to have all the favorites, like pickled jalapenos, ground beef (or ground turkey), queso cheese, cilantro, and pico de gallo.‍Gourmet taquitosTaquitos are usually known for the frozen, microwaveable ones you see in the frozen section of supermarkets. But it’s super easy to make high-quality ones, and with multiple filling options—anything from shredded beef, roast pork, cheese, avocado, and so on.Chocolate fountainSelf-explanatory, but it cannot be underestimated--even if it seems a bit cliché. Include items to dip into the chocolate stream, like strawberries, bananas, wafers, and so on.‍Spring rollsSpring rolls can be made with a wide variety of fillings, and they’re usually very refreshing and light. In Asia, they’re made this way because they’re great to drink with.Sticky rice ballsSticky rice is one of the most underrated Asian foods. They’re super easy to make, and they leave plenty of room for preference. Grab a chunk of marinated chicken and roll sticky rice around it. You could even go sweet with it by using mango.Aesthetically-pleasing sugar panes, like shattered glassThese are super fun to eat and will add a wow-factor to the late-night hours. They are a simple option, but it’s also very unusual. Use natural food colors like turmeric, spinach, or grape skins to achieve beautiful colors, and then eat your sweet “glass.”Brownies and cookiesAt number seven, we have the most basic option and arguably the most loved and cherished. Cookies and brownies, folks. What else could you ever ask for? I’ll leave it at that.‍Burger slidersAnother versatile option, and an all-around favorite, are burger sliders. You can have vegan, vegetarian, and meat-eating options so everyone is satisfied and represented. ‍Steamed bunsA universally-loved favorite across Asian countries and cultures, steamed buns are the ultimate comfort food. Filled with anything from sweet beans to chasu pork, the fluffy steamed buns are tantalizingly satisfying to bite into.Rainbow gourmet friesGetting potatoes of various colors and then making fries out of them might be the next big thing for food spreads. When a bunch of different colors are represented, the result is dazzling and beautiful, and very much unlike what we’re used to with standard fries.‍‍",
                "author": "",
                "date": "October 26, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/how-much-alcohol-should-i-have-at-my-wedding",
                "title": "How Much Alcohol Should I Have at My Wedding?",
                "richtext": "Do I want to have an open bar at my wedding? Would my venue let me bring my own alcohol to serve? Do I need to hire bartenders? How much alcohol should I even have at my wedding?! These might be questions going through your head when you think about having alcohol at your wedding. We compiled some tips and tricks and information about all things bartending from our experts at Ohio Bartenders for Hire to answer any questions you may have!Misconceptions about serving alcohol at your wedding –#1 “I don’t need a bartender! Alcohol can be self-serve!”This is actually a pretty dangerous mindset to have! If guests can get as much alcohol as they want whenever they want, you may end up with a lot of people who’ve had way too much to drink, since there is no one to keep track of how much they’ve had or how they’re acting. Vanessa Long at Ohio Bartenders for Hire trains their bartenders to keep track of how much each guest has been served, and will cut them off if necessary. By having a bartender serving the alcohol, you also eliminate any potential for your underaged cousins from sneaking off with a beer.#2 Bartenders are only there to serve alcoholHaving a bartender actually means the opposite of this! There are so many different options, hot chocolate bars, unique lemonade stands, mocktails, are just a few! Ohio Bartenders for Hire does more than just serve alcohol, they can create a personalized experience for your guests and for you to enjoy on your special day- and you won’t have to worry about any of the details yourself! Leave it to the professionals, and let yourself enjoy your big day!So how much alcohol should I serve?For the wine drinker –According to Ohio Bartenders for Hire, you can get about four glasses of wine from a single bottle, so it's recommended to have four bottles of red wine per 50 guests, and six bottles of white wine per 50 guests.For the beer drinker –Vanessa Long notes that the typical beer drinker will have at least four beers at an event like a wedding, making the recommended amount of beer to be four times however many beer drinkers you expect (if you expect 50 beer drinkers to attend, the recommended number of beers would be 200 glasses or cans).For the liquor or cocktail drinker –Based on Ohio Bartenders for Hire’s recommendations, you should have three 750mL bottles of each spirit per 50 people!",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/ohio-bartenders-for-hire-2",
                "title": "Ohio Bartenders for Hire",
                "richtext": "Ohio Bartenders for Hire has been providing exceptional bartending services for the past four years, creating specialty signature cocktails with and without alcohol for any event. All of their bartenders are certified and highly trained with the ability to create and safely serve hundreds of different cocktails for any special occasion, including “mocktails.” These are festive nonalcoholic drinks that are a mixture of fruit, juices, herbs, and sodas that are combined in the right ratios to provide a delicious flavor that all ages can enjoy. Ohio Bartenders for Hire carries liquor liability insurance for all of their bartenders. They are able to assist the hosts regarding the volume of supplies they will need to purchase and are able to recommend cost-effective sources for their needs. They also offer packages including cups, straws, beverage napkins, ice, mixers, garnishes, troughs, coolers, and more, so the host does not have to worry about running out or over buying for their event.Ohio Bartenders for Hire loves to help create a successful and carefree affair in order for the host to enjoy the event as much as the guests. What sets them apart from other businesses is the training their employees must complete prior to starting their position. All of their bartenders have completed a 40-hour class through Columbus Bartending School and received a certification. Also, the bartenders are TIPS certified so they know how to serve alcohol responsibly in order for the hosts and their guests to have the best experience possible.Meet Vanessa LongVanessa Long is the owner of Ohio Bartenders for Hire, and she has been in the industry for over 20 years. She started as a busser at a private Yacht Club when she was just 16 years old and worked her way up. Shortly after, Vanessa decided to go to school to become a certified paralegal and worked in a prominent Columbus, Ohio criminal defense firm for 10 years while continuing to work in the restaurant industry at the same time. Aside from work, Vanessa loves crafting, scrapbooking, and helping her mother sew items for craft shows. She also enjoys doing family fitness with her husband and three children. They recently added running to their strength training routine last year and even completed two 5k’s as a family.There are many reasons why Vanessa loves working in the wedding industry, but the satisfaction of helping an excited couple fulfill the vision for their special day is her top reason. Her advice to engaged couples is to always hire a bartender even if you were planning on self serve such as bottled beer in a trough. Her reason is an experienced bartender can spot when someone has consumed too much. They can use their experience and training to discreetly cut someone off which saves the host from having to deal with embarrassment or conflict during the event. Bartenders can also take care of other issues, such as making sure that no minors are being served.Check out these reviews!“Words cannot express how much we enjoyed Ms. Vanessa’s services for our event. She exudes professionalism. She went above and beyond to provide individualized services to all our guests. We will absolutely obtain her services for our future events. Thank you Vanessa!!!” -Dr. D.“Vanessa was the consummate professional. She was courteous and attentive. We were all impressed that she jumped right in, asked for little direction and was spot on for the entire time she was there. I would highly recommend her for any of your event needs! -Beth H.ContactPhone: 614-885-9610Email: info@columbusbartendingschool.comWebsite: www.ohiobartendersforhire.comAddress: 5354 North High Street, Columbus, Ohio",
                "author": "Ohio Bartenders for Hire",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/how-to-choose-the-right-caterer-for-your-wedding",
                "title": "How to Choose the Right Caterer for Your Wedding",
                "richtext": "We all know how big the wedding day is for an engaged couple. We also know the amount of stress that comes with making sure your day is absolutely perfect. A major part of your reception is food, which is why we are here to help guide you and give you tips and questions to ask to ensure you find the right caterer for your special day. Hiring the right caterer based on your expectations can be complicated, but it is essential that you choose a caterer that can fulfill and even surpass your expectations. Choosing the right caterer can be the difference between a great wedding reception that wows guests or just another average wedding.Establish a BudgetWhen looking for caterers it is important to establish a budget. Doing this will help you narrow down caterers that can work within your budget. Having a budget will also help the caterers with crafting the perfect menu for your wedding day.Book EarlyYou don’t want to wait until the last minute to book a caterer because there are other couples looking for caterers too. Some wedding venues provide a list of preferred vendors, if not do some research on your own and create a list of caterers that you love. Once you find the perfect caterer, set up appointments with them as soon as possible!Research CaterersLooking on social media can help you to create a vision and get ideas of what you want you might want for your special day. Going online and researching caterers that are popular and trustworthy will help guide you in the process of choosing the right caterer. You can also ask friends or other wedding companies like a photographer if they have any suggestions.Come Prepared to AppointmentsAfter you have established a budget and narrowed down your list of caterers, it is time to set up appointments. It is important to go into appointments already having a vision or idea of what you want. This helps caterers to get a better understanding of what you want.Plan to Offer a Wide Food VarietyWhen planning a large event such as a wedding where there will be a large amount of guests, you need to make sure a variety of food is being served. Many people have food restrictions or adhere to different diets. When designing a menu you want to ensure those who are vegan, pescatarian, gluten free, etc. Have options available for them.Questions to Ask CaterersTo ensure that you go into your appointments with caterers, we’ve gathered some questions to help guide you through the process!The BasicsDo you have my wedding date available?How long have you been in business?Do you have photos of past events?Have you done events at my location?How much time will you need to set up food and drinks?How much space will you need at my venueFood & DrinkWhat are your most popular dishes?What is the difference between a plated meal, buffet, family style, etc.?Can you make kids meals? How much do you charge?Can you make vendor meals? How much do you charge?When will you need a final headcount?When will you need final menu choices?Can you accommodate for dietary restrictions or allergies?Do you use fresh produce? Where do you source your food from?Will food be made on site or brought in?Do you make wedding cakes?Do you offer other desserts?Do you offer package upgrades?Can you provide bartending services?Logistics & DetailsDo you provide linens, table décor, accessories, etc.? If so, what options do you have to choose from?Will your staff handle setting place cards and menus?What is your server to guest ratio?Do we need any special event permits?Do you offer a payment plan?What is your cancellation policy?What is the deposit required to hold my date? When is the final payment due?Are there any fees that aren’t included in the proposal that we should be aware of?Can you provide a list of recent references?",
                "author": "",
                "date": ""
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-flowers",
        "blogMainTitle": "Wedding Flowers",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/top-tips-for-planning-your-wedding-flowers",
                "title": "Top Tips for Planning Your Wedding Flowers",
                "richtext": "Your wedding will consist of many stunning details, such as your bridal attire, a cuisine that will satisfy everyone’s hunger, and of course, the incredible décor! There are many ways in which you can bring your wedding vision to life, including the vision you have for your wedding flowers. These gorgeous, natural elements of décor can bring their own magic to your wedding day.Do you know how to begin choosing the perfect flowers for your own wedding decor? There’s no doubt that looking at all the possibilities can be overwhelming, and you may be in need of a little assistance.Here at Devoted Columbus, we believe that wedding flowers can create an incredible atmosphere for your big day. That’s why we have put together a few tips on how to choose yours. If you are at a loss as to where to start, be sure to continue reading to gain some great insight:Budget. As with any other wedding planning details, budget plays a key role. Determine what your flower budget can be, without breaking the bank, and you can begin planning from there. Your budget will help determine many different things, such as the amount of flowers you can afford, the actual blooms, and the style you can present.Inspiration. You have likely been planning your big day with the help of lovely sources for inspiration. These sources can help create an idea for your blooms. However, it’s still important to find more specific sources of blooms. Pinterest, wedding magazines, Instagram, and many other sources are filled with incredible creations. Gather inspiration to present to your wedding florist so that they can bring your vision to life.Style. Your floral arrangements should complement the theme and color scheme that you have chosen for your big day. For example, if you are hosting a rustic wedding, then flowers commonly found in the country would be perfect, such as sunflowers or wildflowers. However, for a more romantic, fairytale wedding, roses would be most appropriate.Color Scheme.This is an element that should be planned when considering your other wedding décor. This can, in fact, assist you in determining the best blooms for your big day. Let’s say your wedding colors are blush and gold; You can incorporate pink roses into your floral décor, paired with gold charger plates, for a stunning combination.Your wedding flowers are certainly a source of beauty on your big day, so they don’t have to be a source of stress when planning. Here at Devoted Columbus, as a Columbus, Ohio wedding resource, we would be honored to assist you in finding the perfect florist for your wedding day. ",
                "author": "",
                "date": "December 6, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/choosing-your-wedding-flowers-based-on-the-season",
                "title": "Choosing your wedding flowers based on the season",
                "richtext": "If you decide to not go the artificial route when it comes to flowers, knowing what flowers are best during which season could be useful information. If you do not have your heart set on a specific flower when you begin the wedding planning process, it is definitely worth your time to see what is blooming around the date of your big day. Listed below is a guide to the best flowers on the market depending on which season it is. Flowers are a classic part of any wedding decor and you want to make sure your floral arrangements are as fresh and as beautiful as possible! WinterWinter brides might be scared that their bouquet will be slated by the treacherous cold of the winter months, but do not fear! There are many delightful options to choose from, even when the weather outside is frightful. Some of the best winter flower options include carnations, roses and gardenias.FallAs the leaves begin to change so will the selection of fresh flowers to choose from for your big day! But there are many delightful choices during fall months that will leave your guests in awe during autumn months. The pumpkins, ghosts and witches are optional to accompany these fall flowers. Awesome fall flowers include orange gerbera, asiatic lily, and aster.SpringSpring rain showers definitely bring beautiful spring flowers. These romantic and classic options will freshen up any spring time wedding. These spring flower options will create for a youthful and bright wedding just like the season they bloomed in, peonies, hydrangeas, and poppies.SummerSummer is an exciting and bold season and so are the flowers that peak during these toasty months. The air is filled with freedom and these flowers will capture the excitement of this time at your lovely summer wedding. There are so many colors, shapes and sizes that you will have no issue finding the perfect arrangement for your big day in the summer! Amazing flower options include dahlias, birds-of-paradise, and calla liliesSelecting which flowers to have on display at your wedding can seem like a daunting task, but do not get overwhelmed. You should choose whatever flowers you like best because at the end of the day, it is your big day and whatever is going to make you most happy is what really matters most! Happy flower picking!",
                "author": "",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/the-top-floral-trends-for-your-wedding-day",
                "title": "The Top Floral Trends for your Wedding Day",
                "richtext": "Are you in the middle of planning your wedding and need a little floral inspiration? Choosing your floral arrangements and deciding things like which flowers you should use, which colors, or how they should be displayed can be a bit overwhelming. If you need help perfecting your floral masterpiece, here are some of the top flower trends and other unique ideas to enhance the theme of your wedding.Grounded Flora and Floral ArchesWith this year and the different restrictions has come an increase in outdoor weddings. With outdoor weddings comes more ground space that can be utilized. This can be done by creating large statement displays with grounded floras. Instead of spending your whole budget on flora that are spread out through the entire venue, you can use a portion of it to create a statement and accent your ceremony. These pieces can also be designed so that they become centerpieces or venue accents. Another option is to create a floral arch or installment, which becomes a beautiful backdrop for your nuptials. Coordinate it with your color palette of choice, and say “I do” in front of your floral masterpiece.Bold Colors and Different TexturesIn 2021 couples have been straying away from traditional color palettes. Instead, they are opting for more vibrant and bold accent colors. One of the best ways to enhance your wedding day décor is by adding bright floral arrangements. With Covid-19, we could all use a mood boost, and adding bright, stimulating colors is a way to achieve this. Don’t be afraid to stand out this year by choosing bright pinks, oranges, and yellows. One of the Pantone colors of the year this year happens to be “illuminating” yellow. Choose some nudes, and accent them with bright pops of color!Another way to add some dimension to your floral arrangements is by incorporating different textures. This can be done by adding dried flowers, twigs, or grasses. Palm fronds, eucalyptus, preserved roses, thistle, pampas grass, you name it, can add texture to your bouquet. Don’t be afraid about going overboard with this. Find different natural textures you love, and play around with them until you find what’s right for you!Sustainable and Eco-FriendlyIncluding dried flowers in your bouquet not only adds texture, but it’s sustainable! Dried flowers can be kept for many years, and will always be a reminder of one of the happiest days of your life. Other types of greenery like succulents are an eco-friendly option. They don’t need much to survive, and they can be kept or given away as wedding favors. Brides this year have also chosen to take a different route when it comes to floral arrangements. This being organic or recycled fabric bouquets. You can either choose to DIY your own or find a vendor that does. There are many talented people out there that make faux flower bouquets look very real! Another way to save on floral arrangements is by picking wildflowers. They can be found close to home, which means they don’t need to be shipped from all parts of the world.Seasonal Flowers and Locally GrownNot only are locally grown and seasonal flowers sustainable, but choosing to buy them supports local businesses. With Covid-19, more and more locally owned businesses are having to shut their doors, so why not help them out! Choosing to purchase seasonal flowers also means that you’re not having to ship flowers in from another part of the world. If they are in season, then they are readily available in your part of the world. Shipping times have also slowed down tremendously this year. Buying locally ensures that you will get your arrangements on time for your big day.",
                "author": "",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/the-crystal-ballroom-dance-center",
                "title": "The Crystal Ballroom Dance Center",
                "richtext": "‍The Crystal Ballroom Dance Center has been in business for two years now, specializing in teaching individuals of all ages to Connect Through Dance. Located in Worthington, Ohio, the studio offers partner dancing lessons including ballroom, salsa, swing, and tango as well as group classes, parties, and events for everyone! They also offer dance fitness classes and date night classes filled with a great atmosphere for dancers to have a memorable experience. Aside from the dance lessons and other services, they also have a dance boutique with shoes, dancewear and custom made gowns.The Crystal Ballroom Dance Center is customer focused, and they make sure that what you want is what you get. Their instructors are certified and take weekly training to continue improving their skills and dance knowledge. They believe weddings are the perfect time for people to experience the connection, joy and partnership that dancing brings to a relationship. Many people don’t start dancing until their kids have moved out of the house, but weddings and other events give people the opportunity to support their relationship from the beginning. The Crystal Ballroom Dance Center will allow you to create a moment of togetherness.Meet Amy & David RossAmy & David are the owners of The Crystal Ballroom Dance Center. They started their business to create a dance studio that offered it all. Instead of only offering private dance lessons, or just dance parties, they want to be your full service partner dance studio with a caring, educated staff and a beautiful facility with quality education and events. The pair’s work is their mission, and there’s not too much that gets their attention outside of sharing dance with others. Aside from the studio, Amy enjoys being a tomboy most of the time, but her favorite thing to do is put on a ballroom gown and compete. They have two rescued Pit Bull mixed dogs, Belle and Zoey.A great piece of advice that Amy and her husband would give engaged couples is don’t wait until the last minute to find the right dance studio to help you create such a special moment in the stress of wedding planning. They suggest scheduling a consultation as soon as possible so you are prepared to start your dance lessons about 6 months out.For more information about dance lessons for your wedding, here is the link to their website – https://crystalballroomcolumbus.com/wedding-lessons.You can also check out their blog at: https://www.crystalballroomcolumbus.com/blog.Check out these reviews!“Amy & David have a top notch ballroom & studio offering something for about every genre in dance. My wife & I enjoy west coast swing (WCS) & it’s been a memorable time at each event!” -Stephen Ricci.“Amy and her husband are passionate about providing a warm, welcoming environment for all who love dance. There are classes for all levels, from the complete newbie to the experienced swinger. The inside is gorgeous, clean and inviting. I look forward to coming back.” -Bethany George.ContactPhone: 614-505-8698Email: info@crystalballroomcolumbus.comWebsite: http://CrystalBallroomCoumbus.comAddress: 402 East Wilson Bridge Rd. Suite A, Worthington, OH 43085",
                "author": "Crystal Ballroom Dance Center",
                "date": "November 26, 2021"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-favors",
        "blogMainTitle": "Wedding Favors",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/2021-bridesmaid-dress-trends",
                "title": "2021 Bridesmaid Dress Trends",
                "richtext": "Bridesmaid dresses have evolved over the years, and they’re still changing. Here are some of this year's fun and fresh Bridesmaid dress trends!Same Color, Different StylesAll bridesmaids have different preferences, and feel good in different dresses. Not everyone feels comfortable in a strapless or backless dress. That’s why it’s great to offer your Bridesmaids different styles of dresses! There are different sites that have also noticed this trend. On these sites, brides can choose the color and different styles of dresses or jumpsuits that their Bridesmaids can then go look at. These sites allow your girls to pick the dress that they feel most comfortable in, which makes the day even better for everyone!Mixed TexturesAnother trend we’ve seen this year is mixing different textures, whether it be with bouquets or bridesmaid dresses. Different textures add a unique and boho feel to any bridal party. This also allows for the individuality of your bridesmaids to shine through. Different textures to add include floral prints, velvet, satin, lace, and beading. Let your bridesmaids play with ideas, and then have some fun putting together different textures with them!Bridesmaids in JumpsuitsNot everyone loves wearing dresses, so why not offer your bridesmaids another option? Jumpsuits have made an appearance this year in the wedding scene due to more casual weddings. They are a great addition, and they come in all different textures and styles! They’re perfect if you want to add an unconventional option for your bridesmaids. Jumpsuits can also be dressed up or down depending on the overall dress code for your big day.Cowl NecklinesCowl necklines have come back in every area of the fashion industry, and bridal-wear is no exception. Cowl necked dresses come in all different styles that suit any bridesmaid. Like any other dress, they are offered with capped sleeves, spaghetti straps, mid length, or full length. They also come in many different colors and textures. Stay on trend this year by incorporating cowl necklines into your bridesmaid dress lineup!Satin DressesSatin has become the fabric of 2021. It’s almost impossible to look for dresses without seeing satin on your screen! It has a more formal look and feel, which adds elegance to your bridal party. This fabric can be a bit daunting because it is known for being unforgiving, but there are new stretch satin fabrics that are more flattering on all body types. Stretch satin also allows for freer movement, which means that everyone will be able to bust a move on the dance floor!Black DressesMore and more brides are choosing to incorporate black into their color palettes. Black is a classic, sleek, and elegant color that can be found in just about any department store your girls may be shopping at for dresses. It’s an easy color to find, which is great if you’re wanting to mix textures, styles, and accessories!Don’t be afraid to incorporate more than one of these trends into your bridal party’s dress lineup! ",
                "author": "",
                "date": "November 26, 2021"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-entertainment",
        "blogMainTitle": "Wedding Entertainment",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/30-rock-love-songs-to-play-at-your-wedding",
                "title": "30 Rock Love Songs to Play at Your Wedding",
                "richtext": "Rock songs are known for making the listener feel something. If you’re having trouble narrowing down your playlist for your big day, here’s a list of 30 songs to pad your list today! ‍These 30 songs are in three categories: Top Ten, Fast Rock, and Slow Jams! Rock music is one of the best genres to play at your wedding, but all rock is not the same. So, let’s get started!‍TOP TEN‍I Wanna Know What Love Is by ForeignerThis song is a certified crowd-pleaser, and everyone is familiar with the chorus! Marriage can sometimes feel like stepping into an unknown. This song captures the beauty of being ready for love and commitment but also the vulnerability of marriage.‍The Only Exception by ParamoreParamore is an era of rock all on its own. This band puts you in the feels with every song. The Only Exception is the perfect, slow rock ballad that sums up love in the sweetest way.‍You & Me by Dave Matthews BandThis gem by the Dave Matthews Band is another slow and poppy ballad. With lyrics like “you and me together, we can do anything, baby,” it captures the essence of sharing vows and the “’til death do us” part.‍Love Me Like There’s No Tomorrow by Freddie MercuryIf you’re looking for something a bit more exciting, Freddie Mercury is always an excellent choice for a song that is passionate and full of excitement. She is Love by Oasis‍All I Want Is You by U2One can never go wrong with U2! This is one song that is sure to make you and your significant other nostalgic and fall more in love with each other.\tYou Shook Me All Night Long by AC/DCAC/DC will have you and your entire wedding party rocking out for sure! This song is great for an opening wedding reception song that will hype up the reception attendees.‍Marry You by Train‍How Sweet It Is (To Be Loved by You) This song is great whether you the version by James Taylor or Marvin Gaye. It’s a sweet, tender song that captures the beginning stages of love.‍Dance, Dance by Fall Out BoyThis song is a classic for many millennials. This 2000s bop will have everyone, well, dancing!‍FAST ROCK‍You Really Got Me – Mono Mix by The KinksThis song is a great way to ease into the dancing part of your wedding reception. Believe it or not, some people look forward to dancing at weddings. ‍Crazy Little Thing Called Love by QueenClassic Queen, this song is a beautiful song to play at weddings. It’s simple, sweet, and a nice song to sing along to.Shot in the Dark by AC/DC“I need a pick me up…I need a shot of you” No couple can go wrong with AC/DC! This song is fantastic for a wedding party dance.‍2/14 by the Band CaminoJune, After Dark by Elliot RootRough Going (I Won’t Let Up) by Hamilton Leithauser, RotsamShot Through the Heart by Bon JoviWaiting for a Girls Like You by ForeignerAlmost (Sweet Music) by HozierBig Yellow Taxi by Joni Mitchell‍SLOW JAMS‍ Crimson and Clover by Joan Jett and The Blackhearts With this song, you can choose Joan Jett and The Blackhearts or Tommy James and the Shondells. Both versions are classic in their own right.Always by Bon JoviHeart of Gold by Neil YoungCan’t Fight This Feeling by REO SpeedwagonIris by The Goo Goo DollsYou may have heard this song as the backdrop to numerous romance movies!Slow Dancing in a Burning Room by John MayerThis whole list could be made of John Mayer songs, but we’ll stick to just a few of his gems. Waitin On The Day by John MayerThis song oozes first dance wedding feels. John Mayer takes the cake for love rock songs.Half of My Heart by John MayerThis slow and poppy ballad featuring vocals from Taylor Swift is perfection!In Your Eyes by Peter Gabriel Just the Way You Are by Billy Joel‍Choosing songs to play at your wedding can seem stressful when you don’t know where to start. Music is vast, and genres and sub-genres can be confusing. However, with this list, you now have a beacon of hope to get you started to find the perfect song for your perfect day. ‍",
                "author": "",
                "date": "March 4, 2023"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/d-and-m-dj-entertainment",
                "title": "D and M DJ Entertainment",
                "richtext": "D and M DJ Entertainment has been in business since 2015. They are a DJ wedding & event service that offers DJs, a live Trio for ceremonies, and other related services. They specialize in the design of the night. They work closely with their clients to put a timeline together that flows & builds a party full of excitement. Once they have this in hand they carefully mix & program the soundtrack of their life and do their best to fit it in with the time given. They also offer additional lighting, club sound, and photo booth options!What gives them an edge is their customer care and being transparent with services and price. What you see is what you pay. They make it very easy from start to finish as they leave no stone left unturned. They don’t play the game “Money Left on the Table”. They are here to sell their clients services and great entertainment without taking advantage of them. Their prices speak to their talent, equipment, and services they provide.Meet the D in D and M: Meet David KurtzDavid is Co-CEO and DJ of D and M DJ Entertainment. He has been a DJ since 1982! He loves anything to do with the golden age, robber barons, and turn of the century. Outside of being a DJ he loves taking day trips, photography, and movies! He likes building a working relationship with vendors in the market and helping talented DJs find work on a regular basis. His advice to couples is that reviews & referrals are key to finding the wedding services that are right for you!Meet the M in D and M: Mark DerenbergerMark got his first taste of DJing when he accompanied a friend to an event and then for unforeseen circumstances ended up having to DJ the event for his friend.  Since this, Mark has never looked back. He loves to see the look on the bride’s face as she is walking down the aisle.  He loves to watch the roller coaster of emotions from the couple and their guests that music takes them on during their event.  His goal is to take the stress out of the day for his couples and give them an experience that they will remember forever!  Outside of the business, Mark is the proud single father of a high school/career center 2020 graduate.  He is an avid ice hockey fan, holding Columbus Blue Jackets season tickets for the past 11 years and he loves retro old school gaming and owns several old gaming systems.  Check out these reviews!“Dave is the BOMB!”“Dave was great as our wedding DJ. Communication was on par before the wedding. Helped us find the perfect music. Was interactive and entertaining for the guests, and kept us on track after a 45 minutes rain delay, so that nothing was skipped in the reception schedule! Would highly recommend Dave and his company for any fun wedding :)”“Our wedding was awesome! Mark was friendly and really helped us plan the day and pick out songs. He had a bunch of recommendations and was able to add songs I wanted that were not already in his library. The night ran so smoothly and he was able to keep everyone dancing throughout the night!”“We had the pleasure of having Jake as our dj and he did an amazing job! We had some kinda crazy requests and fulfilled each and everyone of them. We had to move the wedding inside and he had to actually move his equipment twice and never said one word about it. He kept our guest happy with a variety of music and he interacted with our favorite people. If I was every going to do this again, I would hire them in a heartbeat! Amazing job!!!!”“We had such a great experience with D and M DJ Entertainment. Website was super easy to navigate. Plus, working with DJ Kurt was easy and fun! He did a great job at our wedding! He has our recommendation!!”Contact:Phone: 614-604-9400Address: 23 E College Ave, Westerville, OH 43081Email: david@dandmdjentertainment.comWebsite: https://dandmdjentertainment.com/Facebook: https://www.facebook.com/dandmdjentertainment/Instagram: https://www.instagram.com/dandmdjentertainment/",
                "author": "D and M DJ Entertainment",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/top-5-ways-to-entertain-wedding-guests",
                "title": "Top 5 Ways to Entertain Wedding Guests",
                "richtext": "Although the main focus of a wedding day should always be the happy couple, it is not a bad idea to come up with some ideas to ensure that your guests are having just as much fun as you are on your big day! Below is a mix of fun and classy activities to have at your wedding to keep friends and family entertained amidst all wedding excitement!1. Photo BoothA photo booth never fails to be a big hit among guests at a wedding. Your friends and family will find themselves finally out of their everyday clothes and dressed up and looking their best in honor of the big day. The best way to capture this moment and give your guests a little something to remember the day by is a photo booth. Your guests will have a fun time snapping photos with old friends and have the pictures to ensure they never forget your big day!2. Dessert or Snack BarA self-serve dessert or snack bar is a delightful way to engage guests and give them a little gift to take home even after the wedding has concluded. In between made-of-honor speeches and the first dance, guests can make their way over to a beautiful buffet of desserts or snacks and prepare themselves a to-go bag for the ride home or walk to the hotel. It is a classy and cute way to make sure your guests feel special and appreciated at your wedding.3. KaraokeKaraoke is an extremely entertaining and fun activity, especially at any event where there is alcohol involved. It will encourage guests to hit the dance floor as they witness their best friends and family attempt another less-than-wonderful rendition of “Don’t Stop Believing” by Journey. But karaoke never fails to bring a crowd together for laughter and song and this would make a great addition to any wedding.4. Video Photo MontageNothing brings a crowd to tears like a photo montage of the happy couple with pictures from awkward middle school days to engagement photos. These videos are always a hit at weddings and it will have your guests laughing at the photo and misty eyes in the next. These videos encompass the essence of the couple’s relationship and let the guests see them evolve as individuals before they tie the knot. It is definitely worth sifting through Grandma’s basement for old photos in order to create this memorable video that the couple will cherish for years!5. Wish LanternsIf you are having an evening reception, wish lanterns are a beautiful and symbolic conclusion to any wedding. Guests can pick up a lantern and supplies to write their wishes for the happy couple when they arrive. Then, at the end of the reception, everyone can gather outside to light and release the lanterns with their wishes attached. This creates not only beautiful scenery, but also gets the guests involved in sending off the couple. It is a classy and meaningful conclusion to any wedding celebration and the guests will appreciate this anecdote for sure!",
                "author": "",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/8-ideas-for-your-groomsmen-proposal",
                "title": "8 Ideas for Your Groomsmen Proposal",
                "richtext": "You’ve already proposed to your fiancé, but have you thought about your proposal to your groomsmen? They’re important too; coming up with a fun proposal for them lets them know just how much you care about them being by your side on your big day! Here are some ideas on how to do it.1. Customize a 6 PackLet the guys know how much you love them by getting them beer! This is a gift they’re bound to use. There are many different websites where you can customize your own carriers for each of your groomsmen. You are able to put their names, whether they’re your best man, or a groomsman, and the date of your wedding. You can either buy each one of them a 6 pack of their favorite beer, or you can mix brands to make your own 6 pack. Mixing allows for everyone to get a little bit of everything.2. Personalized Beer BottlesAnother fun idea for a groomsmen proposal is to do a chugging contest. There are labels that can be made to go around any beer of your choice. The labels will have the guys names on them and either “groomsman” or “best man”. If they say “yes” to your proposal, then they have to chug their designated beer. For this, it’s nice to get each one of your friends their favorite beer. To get them all to your house, offer to have a bonfire, and then surprise them.3. Create a Proposal BoxProposal boxes are super customizable, and they’re a nice gift to give to your groomsmen. There are many different companies out there that allow you to customize the actual boxes. Different things that you can put in the box include custom koozies, matching ties, socks, or cufflinks to wear the day of, cigars for after the wedding, personalized thank you notes, mini bottles of booze, or custom flasks. Let the boys know you care about them and don’t skimp out on the boxes. You can customize them to your budget by making them yourself, or you can choose to order them online. A quick google search will lead you to many different sites that have pre-made boxes for any budget!best man4. Host a Small Get-TogetherWhy not celebrate your groomsmen by throwing a party, hosting a dinner, or going out to a bar. It doesn’t have to be anything big or fancy by any means, but it’ll be nice to get them all together more than once before the big day. You can invite them over for a barbeque, take them to one of your favorite restaurants, or keep it casual by going to a bar you all like. If you have groomsmen from different friend groups or that don’t know each other as well, then this type of gathering is a great idea. They’ll be able to get to know each other more in a very casual setting before the bachelor party and the wedding. This helps to get any awkwardness out beforehand!5. Go Fore the GoldIf you and your groomsmen are always out on the golf course, then this idea might be the one for you! One19Stationary, on Etsy, customizes mini golf themed proposal boxes. Inside is a customized golf ball and tee with each guy's role in the groom's party printed on them (either a groomsmen or best man). GroovyGroomsmenGifts also has many different golf themed gifts to choose from! To take it one step further, schedule a tee time and invite all of the guys out to the course and “propose” there! As an added gesture of gratitude, choose to prepay for their round of golf as a thank you for being a part of your wedding.6. Send some Snail MailIf all of your groomsmen live in different places, or are hard to corral, consider sending a thoughtful yet funny proposal card. Amazon, GroovyGroomsmenGifts, Marrygrams, and Etsy have a wide variety of cards to choose from. Keep the message simple and light, and encourage them to give you a call after they open it!7. Jumbotron ProposalIf you’re looking to surprise and maybe even embarrass your groomsmen, opt to propose on the big screen! Take your guys to a baseball, hockey, or basketball game and pop that very important question. Keep it funny by creating a humorous message or even get down on one knee! Most stadiums will display your proposal message for a fee.8. How to Tie a Tie for DummiesThere’s a good chance your guys don’t know how to tie a tie, so be proactive. Gift them either a tie or bowtie of you and your fiancé’s choice, and tuck in a booklet on how to properly tie their ties. This way they can practice before the big day, and feel confident in their tying abilities. You will have helped teach them a new life skill that they’ll be able to use during wedding season!",
                "author": "",
                "date": "November 26, 2021"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-beauty-hair",
        "blogMainTitle": "Wedding Beauty & Hair",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/how-to-pick-the-perfect-veil-for-your-wedding-outfit",
                "title": "How to Pick the Perfect Veil for Your Wedding Outfit",
                "richtext": "Wedding planning incorporates so much, from dazzling flowers to unique colors, and of course, wedding attire. Part of finding the right outfit is finding the perfect veil for the wedding of the century! It's important to note that veils don't have to complement only wedding dresses. Wedding veils make the ideal accessory for any gender, whether with a dress or a suit. ‍Finding the right outifit with a veil to match can be stressful. The tips we share will put you on the right track to picking the perfect veil for your wedding ensemble. It should be easy to get help, and no one should feel alone in the journey to find the right accessories to express themselves perfectly! ‍It is common at the beginning of planning not to know where to begin to make your vision for your wedding a reality. There are three big things to consider when picking out the perfect veil for your wedding outfit that will help ease your stress when it's time to choose! ‍Budget: Knowing how much you're willing to spend will help you make a wise and fashionable choice on your veil. Some bridal/wedding shops encourage soon-to-be-wed couples to purchase veils alongside their outfit. Doing this will help you narrow down exactly what you want without overspending. You can still achieve your look for your big day on a budget! Style & Fabric: Deciding on the veil style is a massive moment in creating the wedding outfit's total look. Veils come in a variety of styles, lengths, and widths. The best advice for picking the absolutely ideal accessory is to choose one that best compliments your outfit. For example, if your dress or suit features lots of intricate details, a simpler one will do, and vice versa; if your outfit is simple and chic, you may want to opt for a more opulent veil with beautiful detail that stands out in a nice contrast. ‍Hairstyle: Another essential part of choosing a veil is your hairstyle. If you're opting for an updo, the style of the veil will differ drastically versus wearing your hair down. If you have short hair, a birdcage look may be just the ticket.  That finely crafted chignon may pair well with a cathedral style, depending on your overall look. One of the best ways to get this accessory the right length is to have your height measured so you know precisely where the veil falls on your frame. Finding the perfect veil doesn't have to be a chore, but another fun element that goes into planning a day you and your significant other will remember for years to come! ‍",
                "author": "",
                "date": "November 3, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/beauty-appointments-to-schedule-before-your-wedding-day",
                "title": "Beauty Appointments to Schedule Before Your Wedding Day",
                "richtext": "You will want to radiate beauty as you walk down the aisle! After all, your wedding day is one of the most important days of your life, and feeling confident in your appearance is a must. From facials to manicures, there are many ways in which you can accentuate your beauty for such a special occasion.If you take part in beauty appointments before your big day, you can ensure that your lovely attributes will be gorgeously highlighted.We believe that every bride should feel confident in herself on her big day! That’s why, here at Devoted Columbus, we have gathered the top beauty appointments that you will want to schedule prior to your wedding day. If you would like to learn what these appointments are, be sure to continue reading:Radiant Smile. Your smile will be such a prominent feature of your big day! Regardless of if you realize it or not, you will be smiling for many hours. Therefore, pearly whites are a must! A week prior to your wedding day, take a trip to the dentist for a teeth cleaning. Or, for a little extra sparkle, you can take part in whitening regimes, such as with white strips, or dental appointments, to assist you in obtaining an even brighter smile.Glowing Skin. Skin is so important to care for! With pesky pores, oil, and acne, you will certainly want to develop a proper skin routine throughout the weeks leading up to your wedding day. It would be ideal to see a dermatologist or beautician to determine how you should care for your skin specifically. A mild cleanser, toner, and moisturizer for your daily skin care would be ideal, so that your face will be glowing for the big day.Stunning Nails. Your nails may be tiny in appearance, but they can add a lot to your bridal beauty. You can get creative with the style of your nails. From French tips to bold colors, you can choose to showcase elegance for a powerful pop of color. You can even choose your “something blue” to be your nail color! The opportunities are truly endless.If you book beauty appointments before your wedding day, you can feel even more confident for your walk down the aisle. These are just a few that you should consider. Please contact us here at Devoted Columbus to discover professional wedding vendors in Columbus, Ohio.",
                "author": "",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/shop-the-look-bridal-hair-accessories-we-love",
                "title": "Shop the Look: Bridal Hair Accessories We Love",
                "richtext": "Bridal hair accessories can add that extra special detail to your wedding day look. We went shopping on Etsy.com to find some works of art you can wear in your hair and we think you will love.This bridal hair vine is a perfect addition to beach wedding hair waves. Click here to find it on Etsy.Add some flowers to your hair with these amazing blush floral combs. Also comes in white, ivory, and burgundy. You can find this piece on Etsy by clicking here.Searching for some extra bling? These large rhinestone hair combs have you covered. Click here to find it.If you are dreaming of a boho wedding day then this macrame veil is the perfect hair accessory for you. Check out this unique hair accessory out here on Etsy.We love this simple tiara made from Swarovski crystals. Perfect for feeling like a princess on your special day. Click here to check it out.This scattered pearl wedding veil adds a unique twist to the traditional wedding hair accessory. Shop this veil by clicking here.Whatever wedding day look you are going for, you can find that perfect hair accessory to complete the look.",
                "author": "",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/steph-esthi-spa-services",
                "title": "Steph Esthi Spa Services",
                "richtext": "Steph Esthi Spa Services has been in business for 6 years now and recently went solo after previously working with two spas. She specializes in helping people look and feel their best by providing both a holistic and scientific approach to skin care. The company strives to help clients love their skin, but also works on relaxation, energy, and mindfulness in their everyday life. Relaxation massages are included in all skin care services, as well as offering specific relaxation services. Steph Esthi also offers a very unique concierge service which entails a traveling esthetician with a fully equipped mobile spa. They also have a partnership with Medical Spa NP in Lancaster, Ohio for other aesthetic needs including Botox, filler and more. They are extremely proud to work with the best and give their best every time.Steph Esthi Spa Services has a lifetime of experience with clients from the what not to do, to the best ways to get rid of ingrown hair. They use both medical and Ayurveda skills to bring a “touch with Intention” into every service, leaving clients feeling like they have experienced something extraordinary after their treatment. Steph Esthi loves working with couples because she gets to be a part of their journey. She believes it’s a wonderful gift to help others, especially when clients want to feel their most beautiful on their wedding day. Meet Stephanie CharacheStephanie Charache is the owner of Steph Esthi Spa Services, located in Pickerington, Ohio. About 12 years ago, Stephanie experienced a life altering service from an esthetician and realized she didn’t know much about skin as she thought. Since then, Stephanie has become an advanced esthetician trained in both Ayurveda and Oncology Aesthetics with over seven years of body waxing and brow design experience. She has found good resources , ways of eating, relaxing and positive mental focus to fight against the stresses of the world we are all facing today. Stephanie incorporates what she has learned on her personal journey into what she brings to her clients. She wants people to know her esthi room is a safe place to talk or not and a place to leave the stuff at the door, letting the focus fall back on them.Aside from work, Stephanie loves to cook and would have gone to culinary school if she had not become an esthetician. She also enjoys working out at Planet Fitness with her husband, and they plan to travel more as their four kids continue to grow and move on to new adventures in life. She recently welcomed a beautiful dog named Flynn to the family during COVID who can sometimes be a monster, but overall a joy! Stephanie also enjoys reading, listening to music, and visiting the metro parks and zoo on a regular basis.ContactPhone: (614) 406-4268Email: steph@stephesthi.comWebsite: www.stephesthi.comAddress: 2686 N. Columbus St., Lancaster, OH.",
                "author": "Steph Esthi Spa Services",
                "date": "December 3, 2021"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/unique-wedding-services",
        "blogMainTitle": "Unique Wedding Services",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/best-cozy-work-from-home-styles-for-newlyweds",
                "title": "Best Cozy Work From Home Styles For Newlyweds",
                "richtext": "A home office is a must-have now for every home, especially for people looking to work remotely. This setup allows you to work from home, whether for the pandemic or you’re a newlywed. If you’re newlyweds buying their first home, setting up your home office needs to be a cozy arrangement.If you’re a couple working from home, you would both like a comfortable space to work in. Here are some of the best and coziest work from home styles you can use for your new office with your spouse. These will be both efficient and won’t separate either of you any time soon.Seated Opposite SidesEven in real estate open houses, the most classic style that you’ll find is having couples seated on opposite sides. This style offers you and your SO the most access to each other beyond being side to side. It’s also a fantastic way to work while preventing distractions.The opposite side style offers several advantages, especially for couples who need to connect with their colleagues consistently. For starters, noise overlap will be minimal with the right noise-canceling headphones. There’s also a minimal visual distraction from the setup while having an open central area if you want to move around.As for office design, you want something that takes advantage of the open central area. This can be a big main window or a door to a balcony, which radiates natural light and warmth. Opposite seating also allows you quick access to your SO, which means easy cuddles when you have downtime.Classic Side-To-Side OfficeSide-to-side is a classic setup, especially if you prefer a more conventional layout. In the office, you’ll want enough legroom to be able to walk comfortably, so side-to-side gives you a good amount of space. It’s also worth considering ergonomics, especially if the room is longer rather than wider.  Creating a symmetrical setup is crucial, especially if you and your SO share the same space. Additionally, you’ll need an open central area, which is great for walking back and forth, especially during conference calls or meetings. The open rear side area also cuts down potential movement on the back. For this kind of setup, natural light is also essential to create eye breaks. This is especially crucial if your workspace is in a basement or attic to give you an idea of what time of day it is. Ideally, you want easy colors and accents on the walls to make everything easy on the eyes.  Cozy Couch-Corner StyleFor couples that work from home and want to work on the same desk, a couch corner setup is another classic option to consider. This is ideal if you and your partner work together on the same task, such as when working on design work.  The couch corner setup also prevents visual distractions between you and your partner and works perfectly for work that requires a lot of concentration. The couch-corner design is fantastic if you have a big desk or table and you don’t want to obstruct your access to each other. The couch-corner layout also gives you two seats facing each other, so you can easily toss in a snuggle when you’re feeling down. This should be fantastic for office setups where you don’t need to sit around too long for your work. Small Desks, More SpaceNot every newly-wed couple can afford a big house. In most situations, an apartment will have limited space, so the best move is with a small desk setup if this is the case. Small desks offer couples a comfortable and easy design, maximizing space to give you more elbow room.  Small desks are perfect if you’re a couple with a small apartment and don’t need much hardware to operate. You will likely have a small PC, all-in-one or laptop, with enough space to write down notes. Small desks are also great for couples without children who don’t want to invest in a big desk or table.   If you’re opting for small desks, you want to take advantage of the extra space that you get. Invest in sturdy desks that can support your tasks and the weight of your hardware. If you can, invest in additional comfort materials like blankets, chairs, and soft rugs to maximize the cozy factor with your spouse.#Sitting Together at the Same Table If you don’t want a lot of separation and prefer more privacy, a setup like this could work. Many couples choose this kind of setup, especially when working from home offices.  The main idea is to create a setup that merges together, especially if working in the same room. A modern setup like this also has the benefit of combining aesthetics with functionality. You’ll want a setup like this that maximizes the number of workspaces, but also keeps your SO close by.   For this kind of setup, you want an open central area that’s big enough for both of you. The open central area also helps create a more organic layout easy on the eyes.   In terms of colors, you want neutral and complementary colors for the walls. You also want a deep base color for the walls, which brings out the other colors in the room. You want a setup that takes advantage of the heavy central focus and wide side areas for furniture.Our Own Spaces TogetherA home office setup doesn’t have to be a madhouse, and it shouldn’t, primarily if you work from home. But, that doesn’t mean that you shouldn’t create a separate space for your SO, especially if they need to have their own space to work. You can divide the space with a curtain or a solid divider. The key is to create separation by using different colored furniture and putting up a wall. The wall should be neutral so you can paint it later if you want a change of look.This works best for couples who need an isolated space to help them focus or cut down on potential distractions. If you want a way to connect, set up a cuddle station on the offside of the work area. A cozy sofa or an entertainment area should be a fantastic way to recharge.#Final ThoughtsIf you’re a newlywed working from home, you need to make your setup cozy. You want something that’s both functional and also romantic. You want a comfortable layout that maximizes comfort and gives you enough separation to work effectively without significant distractions. Achieving this setup will be easy with the correct layout and interior design. Pick one of our suggestions above, and you should be on your way to enjoying work with your loved one.",
                "author": "",
                "date": "January 20, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/your-marriage-license-in-ohio-by-county",
                "title": "Your Marriage License in Ohio, By County",
                "richtext": "The legal age to marry in Ohio is 18 years old for males & females. Female applicants ages 16 & 17 must have parental consent and may require marriage counseling papers to obtain a marriage license. Marriage license must be obtained in the county where the marriage will take place, or the county where the couple currently resides. License must be acquired no more than 60 days prior to the ceremony. Plan to have a photo IDs, such as a driver’s license and passport, and other legal form of ID such as a social security card or birth certificate. If a bride or groom has been previously married, a divorce or death certificate of previous spouse must be presented. Some counties allow you to pre-complete your paperwork and payment online, and others may require appointments. Make sure to check in advance of going to pick up your marriage license. However, both applicants must go in-person to the location during regular business hours to present legal documents when getting the actual license. Most locations are open Monday through Friday and will be closed for lunch. Methods of payment and cost also vary by county, so be sure to check ahead before you go.We’ve even included links to each county’s website, hours and address for your convenience!Adams CountyAdams County Probate Court110 W Main St #222West Union, Ohio 45693(937) 544-29218am-4pmAllen CountyAllen County Probate Court1000 Wardhill AveLima, Ohio 45805(419) 223-85018:30am-4:30pmAshland County142 West Second StreetAshland, Ohio 44805(419) 282-43258am-4pmAshtabula County25 W Jefferson St, Jefferson, Ohio 44047(440) 576-36378am-4pmAthens CountyProbate Court15 Court StreetAthens, Ohio 45701(740) 592-32518am-3:30pmAuglaize County201 S. Willipie St. Rm. 043Wapakoneta, Ohio 45895(419) 739-67658:30am-4:30pmBelmont CountyBelmont County Clerk of Courts101 West Main StreetSt. Clairsville, Ohio 43950(740) 695-54068:30am-4:15pmBrown CountyProbate Court510 E. State StreetGeorgetown, Ohio 45121(937) 378-65498am-4pmButler CountyProbate Court101 High StreetHamilton, Ohio 45011(513) 877-32948am-4pmCarroll County119 S. Libson Street Suite 202Carrollton, Ohio 44615(330) 627-23238am-4pmChampaign CountyProbate Court200 N Main St, 3rd Fl.Urbana, Ohio 43078(937) 484-10278am-4pmClark CountyProbate Court50 E. Columbia St., 5th Fl.Springfield, Ohio 45502(937) 521-18458am-4:30pmClermont CountyProbate Court2379 Clermont Center Dr.Batavia, Ohio 45103(513) 732-72438am-4pmClinton County46 S South StSecond Floor Ste. #224Wilmington, Ohio 45177(937) 382-22808am-4:30pmColumbiana County105 S. Market StP.O. Box 349Lisbon, Ohio 44432(330) 424-95168am-4pmCoshocton County426 Main StCoshocton, Ohio 43812(740) 622-18378:30am-4pmCrawford County112 E Mansfield St #200Bucyrus, Ohio 44820(419) 562-18968:30am-4:30pmCuyahoga CountyProbate CourtMarriage License Department1 Lakeside Avenue, Room 146Cleveland, Ohio 44113(216) 443-89208:30am-4pmDarke CountyProbate Court300 Garst Ave.Greenville, Ohio 45331(937) 547-73458am-4:30pmDefiance CountyDefiance County Court House221 Clinton Street, 3rd FloorDefiance, Ohio 43512(419) 782-4181Delaware CountyProbate Court140 N. Sandusky Street, Fl. 3Delaware, Ohio 43015(740) 833-26858:30am-4pmErie CountyErie County Courthouse323 Columbus Ave # 1Sandusky, Ohio 44870(419) 627-77058am-4pm M,T,Th,FrFairfield CountyProbate Court224 E. Main Street, Room 308Lancaster, Ohio 43130(740) 652-74648am-4pmFayette County110 E. Court Street – 2nd FloorWashington Court House, Ohio 43160(740) 335-06408am-4pmFranklin CountyProbate Court373 S. High Street, Fl. 23Columbus, Ohio 43215(614) 525-38948am-4:30pmFulton County210 S Fulton StWauseon, Ohio 43567(419) 337-92428:30am-4:30pmGallia CountyGallia County Courthouse18 Locust Street 3rd Fl.Gallipolis, Ohio 45631(740) 446-3842Geauga CountyGeauga County Probate Court231 Main Street Ste 200Chardon, Ohio 44024(440) 279-18308am-4:30pmGreene CountyMarriage License Bureau45 N. Detroit Street, Fl. 1Xenia, Ohio 45385(937) 562-52828am-3:30pmGuernsey CountyProbate/Juvenile Division,  Guernsey County Courthouse801 Wheeling Ave.Cambridge, Ohio 43725(740) 432-92628:30am-4pmHamilton CountyProbate CourtWilliam Howard Taft Center230 E. 9th Street, Floor 10Cincinnati, Ohio 45202(513) 946-35898am-4pmHancock County308 Dorney PlazaFindlay, Ohio 45840(419) 424-70798am-4:30pm M, T, Th, F8:30am-4:30pm WHardin CountyOne Courthouse Sq, Ste 210Kenton, Ohio 43326(419) 674-22308am-4pm M-Th8:00 a.m. to 5:00 p.m. FHarrison CountyCommunity Improvement Corporation, Suite A538 North Main StreetCadiz, Ohio 43907(740) 942-20278:30am-4:30pmHenry CountyProbate Court1853 Oakwood AvenueNapoleon, Ohio 43545(419) 592-48768am to 4:30pmHighland County105 North High StreetHillsboro, Ohio 45133(937) 393-9981Hocking CountyHocking County Courthouse1 East Main StreetLogan, Ohio 43138(740) 385-30228:30-4pm M-FHolmes CountyProbate Court1 E. Jackson St., 2nd FloorMillersburg, Ohio 44654(330) 674-5881Huron CountyProbate Division2 East Main Street, Room 106Norwalk, Ohio 44857(419) 668-43838:30am-4pmJackson County350 Portsmouth StJackson, Ohio 45640(740) 286-14018am-4pmJefferson CountyJefferson County Probate Court16001 State Route 7PO Box 549Steubenville, Ohio 43952(740) 283-85568:30am-4:30pmKnox County111 East High Street, 1st Fl.Mount Vernon, Ohio 43050(740) 393-67988am-4pmLake County105 Main StreetPainesville, Ohio 44077(800) 899-5253Lawrence County1 Veterans SquareIronton, Ohio, 45638(740) 533-4343Licking CountyProbate CourtPublic SquareNewark, Ohio 43055(740) 349-61408:30am-4:30pmLogan CountyLogan County Court Center101 S. Main StreetBellefontaine, Ohio 43311(937) 599-72528:30am-4pm M-Th8:30-11:30am FLorain CountyProbate Court225 Court Street, Fl. 6Elyria, Ohio 44035(440) 329-51758am-3:15pmLucas CountyCourthouse700 Adams Street, Fl. 1Toledo, Ohio 43064(419) 213-43618:30am-4pmMadison CountyProbate Court1 N. Main Street, Room 205London, Ohio 43140(740) 852-07568am-3:30pmMahoning County120 Market StreetYoungstown, Ohio 44503(330) 740-23108 am to 4 pmMarion County222 West Center StreetMarion, Ohio 43302(740) 223-40608:30am-4:30 pmMedina CountyProbate Court93 Public SquareMedina, Ohio 44256(330) 725-97038am-3:30pmMeigs County100 East Second StreetCourthouse, Probate/Juvenile DivisionPomeroy, Ohio 45769(740) 992-30968:30-4pmMercer CountyMercer County Probate / Juvenile Court101 North Main Street, Suite 307Celina, Ohio 45822(419) 586-87798:30 a.m. to 5:00 p.m. M8:30 a.m. to 4:00 p.m. T-FMiami CountyProbate Court201 W. Main Street, Floor 2Troy, Ohio 45373(937) 440-60508am-4pm M-Th8:30am-4pm FMonroe CountyRoom 101 N. Main St. Rm 39Woodsfield, Ohio 43793(740) 472-16548am-4pmMontgomery CountyProbate Court41 N. Perry StreetDayton, Ohio 45402(937) 225-46578:30am-4:15pmMorgan CountyMorgan County Courthouse19 East Main St.McConnelsville, Ohio 43756(740) 962-4752Morrow County48 East High StreetMount Gilead, Ohio 43338(419) 947-55758am-4pmMuskingum County401 Main StreetGround LevelZanesville, Ohio 43701(740) 455-71138:30am-4:30pmNoble County305 CourthouseCaldwell, Ohio 43724(740) 732-4408Ottawa CountyOttawa County Probate CourtSecond Floor, Courthouse315 Madison StreetPort Clinton, Ohio 43452(419) 734-68308:30am-4pmPaulding County201 East Caroline St. Suite 2Paulding, Ohio 45879(419) 399-82568:30am-4pmPerry County105 North Main StreetNew Lexington, Ohio 43764(740) 342-10228am-4pmPickaway CountyProbate Court207 S. Court Street, Rm. 3Circleville, Ohio 43113(740) 474-15248am-3:30pmPike CountyPike County Government Center230 Waverly Plaza Suite 600Waverly, Ohio 45690(740) 947-2560Portage CountyProbate Court203 W Main St.Raveena, Ohio 44266(330) 297-38708am-3:30pmPreble CountyProbate Court101 E. Main Street, Fl. 2Eaton, Ohio 45320(937) 456-81378am-4:30pmPutnam County245 E. Main StOttawa, Ohio 45875(419) 523-30128:30am-4:30pmRichland CountyCommon Pleas Court, Probate Division50 Park Avenue East, 2nd Fl.Mansfield, Ohio 44902(419) 774-55838am-3:45pmRoss CountyRoss County Probate Court2 N. Paint St, Suite AChillicothe, Ohio 45601Phone (740) 774-11798am-4pm M-FSandusky CountySandusky County Probate Court100 North Park AvenueFremont, Ohio 43420(419) 334-62118am-4pmScioto CountyCounty Probate Court Office602 7th StreetPortsmouth, Ohio 45662(740) 355-8306Seneca CountySeneca County Juvenile/Probate Court103 East Market StreetTiffin, Ohio 44883(419) 447-31218:30am-4:30pmShelby CountyShelby County Probate CourtCourthouse, Second Floor100 E. Court StreetSidney, Ohio 45365(937) 498-72638:30am-4pmStark CountyProbate Court110 Central Plz. S.Canton, Ohio 44702(330) 451-77528:30am-4:15pmSummit CountyProbate Court209 S. High StreetAkron, Ohio 44308(330) 643-23468am-4pmTrumball CountyTrumball County Probate Court161 High Street NWWarren, Ohio 44481(330) 675-25218:30am-4:30pmTuscarawas County101 East High Avenue Rm 203New Philadelphia, Ohio 44663(330) 365-32448am-4:30pmUnion CountyProbate Court128 S. Main Street, Ste. 109Marysville, Ohio 43040(937) 645-30298:30am-4pmVan Wert CountyProbate Court121 E. Main St.Van Wert, Ohio 45891(419) 238-00278:30am-5pm M8:30am-4:00pm T-FVinton County100 E. Main StreetMcArthur, Ohio 45651(740) 596-50008:30am-4pmWarren CountyProbate Court570 Justice DriveLebanon, Ohio 45036(513) 695-17718am-4:15pmWashington CountyProbate CourtCourthouse Annex205 Putnam StreetMarietta, Ohio 45750(740) 373-6623 Ext. 24138am-4pmWayne CountyProbate Court107 W. Liberty StreetWooster, Ohio 44691(330) 287-55758am-3pmWilliam CountyProbate CourtOne Courthouse Square, 2nd FlBryan, Ohio 43506(419) 636-15488:30am-4:30pmWood CountyProbate Court1 Courthouse Sq., Fl 2Bowling Green, Ohio 43402(419) 354-92308:30am-4:30pmWyandot CountyWyandot County Probate Court109 S. Sandusky Ave, Room 23Upper Sandusky, Ohio 43351(419) 294-23028:30am-4:30pm‍",
                "author": "",
                "date": "January 10, 2022"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/the-newlyweds-guide-to-buying-their-first-home",
                "title": "The Newlyweds' Guide to Buying Their First Home",
                "richtext": "Navigating home-ownership as a newly married couple can be exciting, but can also come with its fair share of challenges. Juggling two credit histories, two dream home wish lists and learning how to live with a joint checking account can feel overwhelming. Whether you’re currently planning your wedding or you’ve already exchanged your “I do’s,” preparing and planning to buy your future home can help make the process more manageable.Check out these tips if you’re a house-hunting newlywed:1. Determine Your Financial ReadinessWhen you’re home shopping, the first step is knowing how much home you can afford. To decide what is financially attainable for you, calculate your monthly debt-to-income ratio. Make sure to include both incomes when you’re figuring this out. A general rule of thumb suggests using the 28/36 rule, which states that you should spend no more than 28% of your gross monthly income on home-related costs and 36% on total debts, including your prospective mortgage and credit cards. Knowing your creditworthiness is a key factor in the home buying process. While your marital status won’t affect potential mortgage rates, your spouse’s credit score will. Lenders typically consider both credit scores when determining your loan amount and interest rate, often using the lower of the two scores. To increase your chances of getting approved for a mortgage and avoiding high interest rates, it will be important to know your financial standing and your spouse’s.‍‍2. Start SavingIn addition to the upfront costs of buying a home — such as the mortgage payment, down payment and closing costs — you should be prepared for all the hidden (and constant) first-time home buyer costs. These expenses may include a home inspection, property taxes, utility payments and any maintenance and repairs. To avoid overspending, consider looking at homes priced comfortably lower than your maximum loan approval. Experts estimate that first-time home buyers will spend between $5,000 and $10,000 on their homes within the first year. To help cushion your wallet, evaluate your spending habits now and eliminate any excesses, like eating out or impulse buys. This strategy, paired with a realistic understanding of your finances, will allow you to plan to buy your first home without breaking the bank.‍3. Know What You’re Looking ForOnce you’ve figured out how much home you can afford, it’s time to start house hunting! Consider creating two separate wish lists that detail your first-home must-haves and your spouse’s must-haves. Would you prefer something turnkey or a fixer-upper? If you plan on having children, how many bedrooms would fit your growing family? What school districts are in the area? Similar to your wedding, make sure your list is realistic. Focus on your needs, not your wants. Compare your lists and pinpoint what you have in common, such as location or backyard size. Use the features you agree on to build a solid foundation for you and your spouse to make home buying decisions.‍‍‍‍‍‍‍‍4. Find a Reliable Real Estate AgentBuying your first home is a learning process, and hiring a professional can help you make smart choices and avoid costly mistakes. Not every agent will be the right fit for you, so it’s important you know what to expect and what questions to ask before making any commitments. Will this agent vigorously represent your interests? Will they help you make competitive offers and negotiate with sellers? Were recent clients satisfied with their services? Interview a few real estate agents (we recommend three to four) and compare your findings. The agent who seems like the best fit is the one you should call.Becoming a homeowner is all about planning and preparation. As the first major financial decision you and your spouse will make together, consider following these tips to help build your future with ease. ‍‍‍",
                "author": "",
                "date": "December 8, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/neighborhood-boxing-club",
                "title": "Neighborhood Boxing Club",
                "richtext": "Neighborhood Boxing Club has been in the health and wellness business for the past three years. They’re a boxing gym in Columbus, Ohio that specializes in boxing class instruction. Neighborhood Boxing Club focuses on boxing for fitness and not for sport. This creates a judgment-free environment where no one should feel intimidated. Neighborhood Boxing Club offers a family-friendly atmosphere, unlike any other boxing gym. This is what sets them apart from everyone else. Going to the Neighborhood Boxing Club offers a workout that is fun but also challenging! This is a perfect opportunity for you and your fiancé to get fit before the wedding, or blow off some steam from wedding planning. Meet Ron KellyRon Kelly is the owner of Neighborhood Boxing Club. Despite being a fitness guru, Ron ironically is the founder of a Facebook Group called “Donut Connoisseurs of Columbus” – we totally recommend that you join his group! He also admits that some days he eats cereal for breakfast, lunch, and dinner. Ron is also a self-proclaimed child at heart. He loves to play video games! Some of his other hobbies include going to the movies and shooting some hoops, basketball is his favorite sport to play.Fitness wasn’t always easy for Ron; he knows that it takes hard work and dedication to change your body and lifestyle. Ron started his boxing journey about nine years ago by joining a local boxing gym in hopes of losing some weight. In 4 months, he lost 45 pounds! He began to form a love of boxing and decided to become an instructor himself. Ron wanted to inspire and help people reach their fitness goals in the way that he did. After six years of working at that gym, Ron decided to open up his own boxing gym – Neighborhood Boxing Club. Ron is now dedicated to helping people of all walks of life achieve their fitness goals.Ron is now part of the wedding industry because many engaged couples are looking to shed some pounds before their big day. One of the reasons he loves being a part of this industry is because he believes that “weddings and marriage are the stepping stones of creating the building blocks of traditional family values.” He’s happy to be someone that can help couples be healthier for themselves and each other. Ron’s greatest piece of advice for engaged couples is to keep finding more things you like doing together!Check Out These Awesome Reviews!“I’ve been in gyms for many years, have hired trainers, and used to run races, however I tried boxing and I love it!! It’s nothing like I expected. The workout is incredible. Cardio mixed with toning. Can’t be beat if you want a great workout in an hour! All the instructors are wonderful and work at your level, no judgement. Glad I gave it a shot, I’m a believer.”“Humble, Body Positive, Friendly Gym! The atmosphere at Neighborhood is open and inviting.”ContactPhone: (614) 810-7428Email: ronk@neighborhoodboxingclub.comWebsite: Neighborhoodboxingclub.comFacebook: @nboxingcInstagram: @nboxingcAddress: 6100 Huntley Rd, Columbus, OH 43229Photo Credit for Professional Photos: Picture The Love",
                "author": "Neighborhood Boxing Club",
                "date": "December 3, 2021"
            },
            {
                "url": "https://www.devotedcolumbus.com/post/the-crystal-ballroom-dance-center-2",
                "title": "The Crystal Ballroom Dance Center",
                "richtext": "The Crystal Ballroom Dance Center has been in business for two years now, specializing in teaching individuals of all ages to Connect Through Dance. Located in Worthington, Ohio, the studio offers partner dancing lessons including ballroom, salsa, swing, and tango as well as group classes, parties, and events for everyone! They also offer dance fitness classes and date night classes filled with a great atmosphere for dancers to have a memorable experience. Aside from the dance lessons and other services, they also have a dance boutique with shoes, dancewear and custom made gowns.The Crystal Ballroom Dance Center is customer focused, and they make sure that what you want is what you get. Their instructors are certified and take weekly training to continue improving their skills and dance knowledge. They believe weddings are the perfect time for people to experience the connection, joy and partnership that dancing brings to a relationship. Many people don’t start dancing until their kids have moved out of the house, but weddings and other events give people the opportunity to support their relationship from the beginning. The Crystal Ballroom Dance Center will allow you to create a moment of togetherness.Meet Amy & David RossAmy & David are the owners of The Crystal Ballroom Dance Center. They started their business to create a dance studio that offered it all. Instead of only offering private lessons, or just dance parties, they want to be your full service partner dance studio with a caring, educated staff and a beautiful facility with quality education and events. The pair’s work is their mission, and there’s not too much that gets their attention outside of sharing dance with others. Aside from the studio, Amy enjoys being a tomboy most of the time, but her favorite thing to do is put on a ballroom gown and compete. They have two rescued Pit Bull mixed dogs, Belle and Zoey.A great piece of advice that Amy and her husband would give engaged couples is don’t wait until the last minute to find the right dance studio to help you create such a special moment in the stress of wedding planning. They suggest scheduling a consultation as soon as possible so you are prepared to start lessons about 6 months out.For more information about dance lessons for your wedding, here is the link to their website – https://crystalballroomcolumbus.com/wedding-lessons.You can also check out their blog at: https://www.crystalballroomcolumbus.com/blog.Check out these reviews!“Amy & David have a top notch ballroom & studio offering something for about every genre in dance. My wife & I enjoy west coast swing (WCS) & it’s been a memorable time at each event!” -Stephen Ricci.“Amy and her husband are passionate about providing a warm, welcoming environment for all who love dance. There are classes for all levels, from the complete newbie to the experienced swinger. The inside is gorgeous, clean and inviting. I look forward to coming back.” -Bethany George.ContactPhone: 614-505-8698Email: info@crystalballroomcolumbus.comWebsite: http://CrystalBallroomCoumbus.comAddress: 402 East Wilson Bridge Rd. Suite A, Worthington, OH 43085",
                "author": "The Crystal Ballroom Dance Center",
                "date": "December 3, 2021"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/honeymoons",
        "blogMainTitle": "Honeymoons",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/staycation-honeymoon-locations-in-columbus-ohio",
                "title": "Staycation Honeymoon Locations in Columbus, Ohio",
                "richtext": "As much as we all love a beach getaway, that is not always possible whether it be time or finances! Columbus, Ohio has many locations where newlyweds can escape for a little getaway without committing to a full vacation.Check out Devoted Columbus’ favorite honeymoon staycation destinations around the Columbus, Ohio area. Columbus Zoo and Aquarium Travel the world in one day without even leaving Columbus! The Columbus Zoo and Aquarium is one of the top rated zoos in The United States. Travel locations such as Africa, Asia, North America, and Australia. This is a great way to bond with your new spouse while exploring the different regions of the world!Photo credit: Amy Ann Photo‍Short NorthThe Short North, located in downtown Columbus, Ohio and is the hub of all things restaurants, hotels, and activities! Whether it be hopping the numerous art galleries or trying one of the dozens of restaurants the Columbus Short North Art District is full of fun and culture. You can complete your stay by relaxing in one of the luxurious hotels including The Graduate Columbus, Hilton Downtown Columbus, The Moxy, and so much more! Other attraction include the north market and the candle lab. you and your new spouse will never get bored.Photo Credit: The Columbus MonthlyFranklin Park Conservatory",
                "author": "",
                "date": "April 21, 2022"
            }
        ]
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/wedding-pros",
        "blogMainTitle": "Columbus Wedding Pros",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": []
    },
    {
        "blogMainMainUrl": "https://www.devotedcolumbus.com/inspirations/bridesmaids-wedding-party",
        "blogMainTitle": "Bridesmaids & Wedding Party",
        "blogMainDescription": "A style savvy, inspirational wedding blog devoted to the modern bride's journey with real weddings, vendor recommendations and more! Join us on and our experts along as you navigate your way down the altar!",
        "blogDetails": [
            {
                "url": "https://www.devotedcolumbus.com/post/how-to-unwind-with-the-girls-before-the-big-day",
                "title": "How To Unwind With The Girls Before The Big Day",
                "richtext": "Thinking about everything that goes into planning your wedding takes a lot of time and energy, and can cause quite a bit of stress. Rather, leave the details and hustle and bustle to your wedding planner, and treat yourself. Here are three ways for you and your bridal party to relax before you say I do. ‍Have a Spa DayA wonderful way for you and your girls to relax is to have a spa day. You could set up some beauty appointments, go out to a spa and enjoy the jacuzzi, a massage, or a mani or pedi, and let the nerves for your wedding melt away. For a low-key day, you could have your friends over to your place for a DIY spa day. It can be relaxing to just stay home and not have to go anywhere. You and your friends could have fun by doing each other’s skincare, makeup, and hair. Relax by applying anti-aging skin care products to target dark spots, using essential oils, and getting out some new makeup. Not only is this relaxing but it can also help you look radiant for your wedding day by taking care of your skin and body. Try Wine TastingWhy not indulge in a wine tasting with your bridesmaids. Get dressed up and get ready for a relaxing and sophisticated evening out. Some great options could be going to a local winery, on a wine tour, or heading out to a tasting room. Whatever you choose, be sure to pick a locale that has a variety of wines to satisfy everyone's palate such as sweet, dry, bubbly, domestic, or imported. It can be a bonus to opt for a winery if possible. You could enjoy the beauty of the vineyard, see how the wine is made, or smash the grapes to make your own wine! Who knows, you might even find a new favorite that can turn into your signature drink to serve your guests at your wedding.Relax With a Private Yoga SessionAnother great option for you to find your calm in the crunch leading up to your wedding is to opt for a private yoga session. You and your bridal party can have the studio all to yourself and the instructor can put together a session that is tailored to you. Focus on your breathing, flexing your muscles, and even learning about your chakras. Instead of being in the studio, depending on the time of year, you could also set up a yoga session in a place like a sunflower field or by the lake. Whatever you choose, this is a great way for you and your bridesmaids to get away from it all. The days leading up to your wedding can be overwhelming. If you're getting married soon it's important to try your best to just let loose, have fun, and unwind with your friends. You and your besties are sure to create memories to last a lifetime, that will make your wedding journey unforgettable. ",
                "author": "",
                "date": "January 31, 2022"
            }
        ]
    }
]